Repository: a-nassif/edraak
Catalog: conf/locale/*/LC_MESSAGES/mako.po
Languages: ar

source: Download video
ar: تنزيل الفيديو

source: here
ar: هنا

source: Download subtitles
ar: تنزيل العناوين الفرعية

source: Your words:
ar: كلماتك:

source: Total number of words:
ar: إجمالي عدد الكلمات:

source: Open Response
ar: إجابات بنهايات مفتوحة

source: Assessments:
ar: التقييمات:

source: Hide Question
ar: إخفاء السؤال

source: New Submission
ar: تسليم جديد

source: Next Step
ar: الخطوة التالية

source: Legend
ar: الإيضاح

source: Submitted Rubric
ar: نموذج التقييم المقدَم

source: Toggle Full Rubric
ar: نموذج التقييم الكامل قابل للتبديل

source: See full feedback
ar: رؤية جميع الآراء والملاحظات

source: Respond to Feedback
ar: الرد على الآراء والملاحظات

source: How accurate do you find this feedback?
ar: ما مدى دقة هذه التغذية الراجعة برأيك؟

source: Correct
ar: صحيح

source: Partially Correct
ar: صحيح جزئياً

source: No Opinion
ar: لا رأي

source: Partially Incorrect
ar: غير صحيح جزئياً

source: Incorrect
ar: غير صحيح

source: Additional comments:
ar: تعليقات إضافية:

source: Submit Feedback
ar: تقديم التغذية الراجعة

source: Response
ar: إجابة

source: Unanswered
ar: لا إجابة عليه

source: Skip Post-Assessment
ar: تخطي ما بعد التقييم

source: There was an error with your submission. Please contact course staff.
ar: حدث خطأ في عملية التسليم الخاصة بك. الرجاء الاتصال بطاقم المقرر.

source: Rubric
ar: معايير التقييم

source: Please enter a hint below:
ar: الرجاء إدخال تلميح على الإجابة أدناه:

source: Cohort groups
ar: مجموعات جماعية

source: Show cohorts
ar: إظهار الجماعات

source: Cohorts in the course
ar: الجماعات في المقرر

source: Add cohort
ar: إضافة جماعة

source: Add users by username or email. One per line or comma-separated.
ar: أضف المستخدمين باستعمال اسم المستخدم أو عنوان البريد الإلكتروني، واحد لكل سطر أو مع فصلهم بفواصل.

source: Add cohort members
ar: أضف أعضاء الجماعة

source: {chapter}, current chapter
ar: {chapter}، الفصل الحالي

source: due {date}
ar: تاريخ التسليم {date}

source: An error occurred. Please try again later.
ar: حدث خطأ. الرجاء إعادة المحاولة في وقتٍ لاحق.

source: About {course.display_number_with_default}
ar: نبذة عن {course.display_number_with_default}

source: You are registered for this course {course.display_number_with_default}
ar: أنت مسجل في هذا المقرر {course.display_number_with_default}

source: View Courseware
ar: استعراض المنهاج التعليمي

source: This course is in your <a href="{cart_link}">cart</a>.
ar: هذا المقرر موجود ضمن <a href="{cart_link}">cart</a>سلّة التسوّق</a>.

source: Add {course.display_number_with_default} to Cart ({currency_symbol}{cost})
ar: إضافة {course.display_number_with_default} إلى سلة التسوّق ({currency_symbol}{cost})

source: Register for {course.display_number_with_default}
ar: قم بالتسجيل في {course.display_number_with_default}

source: Overview
ar: نظرة عامة

source: Share with friends and family!
ar: المشاركة مع الأصدقاء والعائلة!

source: Classes Start
ar: تبدأ المقررات

source: Classes End
ar: تنتهي المقررات

source: Estimated Effort
ar: الجهد المقدّر

source: Prerequisites
ar: المتطلبات الأساسية

source: Additional Resources
ar: مصادر إضافية

source: Staff view
ar: استعراض الطاقم

source: Student view
ar: شاشة الطالب

source: Explore free courses from {university_name}.
ar: الاطلاع على المقررات المجانية من {university_name}.

source: Explore free courses from leading universities.
ar: الاطلاع على المقررات المجانية من الجامعات الرائدة.

source: Courseware
ar: المنهاج التعليمي

source: There has been an error on the {span_start}{platform_name}{span_end} servers
ar: حدث خطأ معين على مخدّمات {span_start}{platform_name}{span_end}

source: We're sorry, this module is temporarily unavailable. Our staff is working to fix it as soon as possible. Please email us at '<a href="mailto:{tech_support_email}">{tech_support_email}</a>' to report any problems or downtime.
ar: نأسف لكون هذا النموذج غير متاح مؤقتاً. يعمل طاقمنا على إصلاح المسألة في أقرب وقتٍ ممكن. الرجاء مراسلتنا على البريد '<a href="mailto:{tech_support_email}">{tech_support_email}</a>' للإبلاغ عن أية مشكلات أو أوقات توقّف.

source: {course_number} Courseware
ar: {course_number} المنهاج التعليمي

source: Return to Exam
ar: العودة للامتحان

source: Course Navigation
ar: تصفح المقرر

source: Open Calculator
ar: فتح الآلة الحاسبة

source: Calculator
ar: الآلة الحاسبة

source: Hints
ar: التلميحات

source: Suffixes:
ar: الملحقات:

source: Operations:
ar: العمليات:

source: Functions:
ar: الوظائف:

source: Constants
ar: الثوابت

source: Grade summary
ar: ملخص الدرجة

source: Not implemented yet
ar: غير مطبقَ بعد

source: Gradebook
ar: دفتر الدرجات

source: {course.display_number_with_default} Course Info
ar: معلومات المقرر {course.display_number_with_default}

source: Course Updates &amp; News
ar: تحديثات وأخبار المقرر

source: Handout Navigation
ar: تصفح الورقة الموزّعة

source: Course Handouts
ar: الأوراق الموزّعة للمقرر

source: Try New Beta Dashboard
ar: قم بتجربة صفحة المعلومات الرئيسية قيد الاختبار

source: Edit Course In Studio
ar: قم بتعديل المقرر في الاستوديو

source: Instructor Dashboard
ar: صفحة المعلومات الرئيسية للموجّه

source: Psychometrics
ar: القياس النفسي

source: Forum Admin
ar: مشرف المنتدى

source: Enrollment
ar: التسجيل

source: DataDump
ar: تفريغ البيانات

source: Manage Groups
ar: إدارة المجموعات

source: Analytics
ar: التحليلات

source: yes
ar: نعم

source: Grade Downloads
ar: تحميل الدرجات

source: Note: some of these buttons are known to time out for larger courses. We have temporarily disabled those features for courses with more than {max_enrollment} students. We are urgently working on fixing this issue. Thank you for your patience as we continue working to improve the platform!
ar: ملاحظة: بعض هذه الأزرار تتّسم بكونها تصبح غير فعّالة بعد مدّة محدّدة بالنسبة للمقررات الضخمة. لقد قمنا بتعطيل تلك الميزات مؤقتاً بالنسبة للمقررات التي تشمل أكثر من {max_enrollment} طالباً. ونحن نعمل بأسرع شكلٍ ممكن على إصلاح هذه المشكلة، ونشكركم على صبركم بينما نعمل بشكلأٍ متواصل على تحسين منصة!

source: Export grades to remote gradebook
ar: تصدير العلامات إلى سجل درجات خارجي

source: The assignments defined for this course should match the ones stored in the gradebook, for this to work properly!
ar: يجب أن تطابق الواجبات المطلوبة المحدّدة لهذا المقرر تلك الموجودة في سجل الدرجات، حتى يعمل البرنامج بشكلٍ صحيح!

source: Gradebook name:
ar: اسم سجل الدرجات:

source: Assignment name:
ar: اسم الواجب المطلوب:

source: Course-specific grade adjustment
ar: تعديل الدرجات بحسب المقرر

source: Specify a particular problem in the course here by its url:
ar: قم بتحديد مسألة معينة في المقرر هنا عن طريق رابط صفحة الإنترنت url الخاص بها:

source: You may use just the "urlname" if a problem, or "modulename/urlname" if not. (For example, if the location is <tt>i4x://university/course/problem/problemname</tt>, then just provide the <tt>problemname</tt>. If the location is <tt>i4x://university/course/notaproblem/someothername</tt>, then provide <tt>notaproblem/someothername</tt>.)
ar: بإمكانك استخدام فقط "اسم رابط الصفحة" في حال وجود مشكلة، أو "اسم النموذج/اسم رابط الصفحة" في حالة عدم وجود مشكلة. (على سبيل المثال، إذا كان الموقع هو <tt>i4x://university/course/problem/problemname</tt>، عندها يكفي إعطاء <tt>problemname</tt>. أما إذا كان الموقع <tt>i4x://university/course/notaproblem/someothername</tt>، عندها يجب إعطاء <tt>notaproblem/someothername</tt>.)

source: Then select an action:
ar: ثم قم باختيار إجراء:

source: These actions run in the background, and status for active tasks will appear in a table below. To see status for all tasks submitted for this problem, click on this button:
ar: تتم هذه الإجراءات في خلفية النظام، وستظهر حالة المهام الفعّالة في الجدول أدناه. لتشاهد حالة جميع المهام المقدمة لهذه المسألة، اضغط على هذا الزر:

source: Student-specific grade inspection and adjustment
ar: فحص وتعديل الدرجات لطالب معين

source: Specify the {platform_name} email address or username of a student here:
ar: قم بتحديد البريد الالكتروني واسم المستخدم الخاص بالطالب في {platform_name} هنا:

source: Click this, and a link to student's progress page will appear below:
ar: اضغط على هذا، وسيظهر رابط صفحة تطور الطالب أدناه:

source: You may also delete the entire state of a student for the specified module:
ar: بإمكانك كذلك حذف حالة طالب بالكامل للنموذج المحدد:

source: Rescoring runs in the background, and status for active tasks will appear in a table below. To see status for all tasks submitted for this problem and student, click on this button:
ar: تتم إعادة التقييم في خلفية النظام، وستظهر حالة المهام الفعّالة في الجدول أدناه. لتشاهد حالة جميع المهام المقدمة لهذه المسألة وللطالب، اضغط على هذا الزر:

source: Select a problem and an action:
ar: اختر مسألة وإجراء:

source: User requires forum administrator privileges to perform administration tasks. See instructor.
ar: يحتاج المستخدم صلاحيات مشرف منتدى لأداء مهام الإشراف. الرجوع للموجِه.

source: Enrollment Data
ar: بيانات التسجيل

source: Pull enrollment from remote gradebook
ar: سحب التسجيل من سجل الدرجات الخارجي

source: Section:
ar: القسم:

source: Batch Enrollment
ar: التسجيل على دفعات

source: Enroll or un-enroll one or many students: enter emails, separated by new lines or commas;
ar: سجِل أو إلغ تسجيل أحد أو مجموعة من الطلاب: أدخل عناوين البريد الإلكتروني، مع الفصل بينها بإدخال أسطر جديدة أو فواصل:

source: Notify students by email
ar: قم بإعلام الطلاب بواسطة البريد الإلكتروني

source: Auto-enroll students when they activate
ar: سجِل الطلاب بشكلٍ آلي لدى قيامهم بالتفعيل

source: Problem urlname:
ar: عنوان صفحة الإنترنت url للمسألة:

source: Enter usernames or emails for students who should be beta-testers, one per line, or separated by commas. They will get to see course materials early, as configured via the <tt>days_early_for_beta</tt> option in the course policy.
ar: أدخل أسماء المستخدم أو عناوين البريد الإلكتروني للطلاب الذين سيقومون بدور مختبري البرنامج، كلٌ منها على سطر، أو بفصلها باستعمال الفواصل. سيتسنى لهم الاطلاع على مواد المقرر بشكلٍ مبكر، بحسب الإعدادات المعتمدة في خيار <tt>days_early_for_beta</tt> ضمن سياسة المقرر.

source: Send to:
ar: إرسال إلى:

source: Myself
ar: نفسي

source: Staff and instructors
ar: الطاقم والموجّهون

source: All (students, staff and instructors)
ar: الجميع (الطلاب، الطاقم، والموجّهون)

source: Subject:
ar: الموضوع:

source: Please try not to email students more than once a day. Important things to consider before sending:
ar: الرجاء محاولة عدم إرسال رسائل إلكترونية للطلاب لأكثر من مرة واحدة في اليوم. فيما يلي بعض النقاط الهامة التي يجب أخذها بعين الاعتبار قبل الإرسال:

source: Have you read over the email to make sure it says everything you want to say?
ar: هل قمت بمراجعة الرسالة مرة أخرى لضمان أنها تشمل جميع ما تود ذكره؟

source: Have you sent the email to yourself first to make sure you're happy with how it's displayed?
ar: هل قمت بإرسال الرسالة لنفسك أولاً للتأكد من أنك راضٍ عن طريقة عرضها؟

source: No Analytics are available at this time.
ar: لا تتوفر تحليلات حالياً

source: Students enrolled:
ar: الطلاب المسجَلون:

source: Students active in the last week:
ar: الطلاب الفاعلون في الأسبوع الماضي:

source: Student activity day by day
ar: أنشطة الطلاب يومأً بيوم

source: Day
ar: اليوم

source: Students
ar: الطلاب

source: Answer distribution for problems
ar: توزيع الإجابات للمسائل

source: Problem
ar: المسألة

source: Max
ar: الحد الأعلى

source: Points Earned (Num Students)
ar: النقاط المستحقَة (Num Students)

source: Students answering correctly
ar: الطلاب الذين أجابوا بطريقةٍ صحيحة

source: Number of students
ar: عدد الطلاب

source: Student distribution per country, all courses, Sep-12 to Oct-17, 1 server (shown here as an example):
ar: توزيع الطلاب في كل دولة، كافة المقررات، الفترة من 12-سبتمبر وحتى 17-أكتوبر، مخدّم واحد (يظهر هنا كمثال):

source: Pending Instructor Tasks
ar: مهام الموجِّه المعلقة

source: Task Type
ar: نوع المهمة

source: Task inputs
ar: مدخلات المهمة

source: Task Id
ar: رقم التعريف للمهمة

source: Requester
ar: مقدم الطلب

source: Task State
ar: حالة المهمة

source: Duration (sec)
ar: المدة المستغرقة (sec)

source: Task Progress
ar: تطوّر المهمة

source: unknown
ar: غير معروف

source: Course errors
ar: أخطاء المقرر

source: About {course_id}
ar: نبذة عن {course_id}

source: Coming Soon
ar: قريباً

source: About {course_number}
ar: نبذة عن {course_number}

source: Access Courseware
ar: الدخول للمنهاج التعليمي

source: You Are Registered
ar: أنت مسجَل

source: Register for
ar: قم بالتسجيل في

source: Registration Is Closed
ar: التسجيل مغلق

source: enroll
ar: تسجيل

source: News - MITx 6.002x
ar: أخبار- MITx 6.002x

source: Updates to Discussion Posts You Follow
ar: تحديثات المنشورات في النقاشات التي تقوم بمتابعتها

source: Anonymous
ar: مجهول

source: {user} posted a {comment} to the thread {thread} in discussion {discussion}
ar: نشر المستخدم {user} التعليق {comment} في السلسلة {thread} في النقاش {discussion}

source: {user} posted a new thread {thread} in discussion {discussion}
ar: نشر المستخدم {user} موضوعاً جديداً {thread} ضمن النقاش {discussion}

source: {user} mentioned you in the thread {thread} in disucssion {discussion}
ar: قام المستخدم {user} بذكرك في الموضوع {thread} ضمن النقاش {discussion}

source: {user} mentioned you in {comment} to the thread {thread} in discussion {discussion}
ar: قام المستخدم {user} بذكرك في التعليق {comment} على الموضوع {thread} ضمن النقاش {discussion}

source: {course_number} Progress
ar: التطور في المقرر {course_number}

source: Course Progress for Student '{username}' ({email})
ar: تطور الطالب ({email}) '{username}' في المقرر

source: No problem scores in this section
ar: لا يوجد درجات للمسائل في هذا القسم

source: You were most recently in {section_link}. If you're done with that, choose another section on the left.
ar: لقد كنت مؤخراً في القسم {section_link}. إذا انتهيت من العمل فيه، الرجاء اختيار قسمٍ آخر من اليسار.

source: {course_number} {course_name} Cover Image
ar: {course_number} {course_name} صورة الغلاف

source: Enrolled as:
ar: مسجل كـ:

source: ID Verified
ar: تم التحقق من الهوية

source: Course Completed - {end_date}
ar: تاريخ انتهاء المقرر - {end_date}

source: Course Started - {start_date}
ar: تاريخ ابتداء المقرر - {start_date}

source: Course Starts - {start_date}
ar: يبتدئ المقرر - {start_date}

source: Final course details are being wrapped up at this time. Your final standing will be available shortly.
ar: يتم حالياً استكمال التفاصيل النهائية للمقرر، وسيكون تصنيفك النهائي متاحاً قريباً.

source: Your final grade:
ar: درجتك النهائية:

source: Grade required for a certificate:
ar: الدرجة المطلوبة للحصول على الشهادة:

source: Your certificate is being held pending confirmation that the issuance of your certificate is in compliance with strict U.S. embargoes on Iran, Cuba, Syria and Sudan. If you think our system has mistakenly identified you as being connected with one of those countries, please let us know by contacting {email}.
ar: لقد تم حجز شهادتك بانتظار التأكيد على أن إصدارها يلتزم بمقتضيات الحظر الأمريكي الصارم على إيران، وكوبا، وسوريا، والسودان. إذا كنت تعتقد أن نظامنا قد ربطك بالخطأ مع أيٍ من هذ الدول، الرجاء إعلامنا من خلال التواصل مع {email}.

source: Your Certificate is Generating
ar: شهادتك قيد الإصدار

source: This link will open/download a PDF document
ar: هذا الرابط سيقوم بفتح/تنزيل ملف PDF

source: Complete our course feedback survey
ar: استكمال استبيان الآراء والملاحظات الخاص بالمقرر

source: View Archived Course
ar: مراجعة المقرر المحفوظ في الأرشيف

source: View Course
ar: استعراض المقرر

source: Email Settings
ar: إعدادات عنوان البريد الإلكتروني

source: Results:
ar: النتائج:

source: Sorry! We can't find anything matching your search. Please try another search.
ar: للأسف! لا نستطيع إيجاد ما يطابق بحثك. الرجاء تجربة بحث آخر.

source: There are no posts here yet. Be the first one to post!
ar: لا يوجد منشورات هنا بعد. كن أول من يقوم بالنشر!

source: New Post
ar: منشور جديد

source: Filter Topics
ar: تصفية مواضيع البحث

source: Show All Discussions
ar: أظهر جميع النقاشات

source: Show Flagged Discussions
ar: أظهر النقاشات المعلَّمة

source: Posts I'm Following
ar: المنشورات التي أقوم بمتابعتها

source: follow this post
ar: تابع هذا المنشور

source: post anonymously
ar: انشر دون التعريف بالهوية

source: post anonymously to classmates
ar: انشر لزملاء الصف دون التعريف بالهوية

source: Make visible to:
ar: اجعله مرئياً بالنسبة لـ:

source: All Groups
ar: كافة المجموعات

source: My Cohort
ar: جماعتي

source: new post title
ar: عنوان منشور جديد

source: Add post
ar: أضف منشور

source: Create new post about:
ar: أنشئ منشوراً جديداً عن:

source: Filter List
ar: تصفية قائمة البحث

source: Following
ar: يتابع

source: Search posts
ar: البحث في المنشورات

source: Hide
ar: إخفاء

source: This post visible only to group {group}.
ar: هذا المنشور مرئي بالنسبة لمجموعة {group} فقط.

source: Discussion Home
ar: الصفحة الرئيسية للنقاش

source: Discussion Topics
ar: مواضيع النقاش

source: Discussion topics; current selection is:
ar: مواضيع النقاش، الاختيار الحالي هو:

source: Sort by:
ar: الترتيب بحسب:

source: date
ar: التاريخ

source: votes
ar: الأصوات

source: comments
ar: التعليقات

source: Show:
ar: إظهار:

source: View All
ar: إظهار الكل

source: View as {name}
ar: الاستعراض كـ {name}

source: This thread is closed.
ar: هذا الموضوع مغلق.

source: Post a response:
ar: انشر رداً:

source: &bull; This thread is closed.
ar: &bull; هذا الموضوع مغلق.

source: Report Misuse
ar: الإبلاغ عن إساءة استعمال

source: Pin Thread
ar: ثبّت الموضوع

source: Close
ar: إغلاق

source: Editing post
ar: تعديل منشور

source: Edit post title
ar: تعديل عنوان المنشور

source: Update post
ar: تحديث منشور

source: Add a comment
ar: إضافة تعليق

source: Editing response
ar: تعديل رد

source: Update response
ar: تحديث رد

source: Toggle Notifications Setting
ar: تبديل إعدادات الإشعارات

source: Revoke Moderator rights
ar: إلغاء حقوق الوسيط

source: Promote to Moderator
ar: الترقية لصفة وسيط

source: Discussion - {course_number}
ar: نقاش - {course_number}

source: We're sorry
ar: نعتذر

source: The forums are currently undergoing maintenance. We'll have them back up shortly!
ar: يتم حالياً إجراء بعض أعمال الصيانة على المنتديات . سيتم إعادة تفعيلهم قريباً!

source: User Profile
ar: ملف بيانات المستخدم

source: Active Threads
ar: المواضيع الفعالة

source: {course_number} Staff Grading
ar: تقييم الطاقم للمقرر {course_number}

source: Staff grading
ar: تقييم الطاقم

source: This is the list of problems that currently need to be graded in order to train AI grading and create calibration essays for peer grading. Each problem needs to be treated separately, and we have indicated the number of student submissions that need to be graded. You can grade more than the minimum required number of submissions--this will improve the accuracy of AI grading, though with diminishing returns. You can see the current accuracy of AI grading in the problem view.
ar: هذه قائمة المسائل التي يلزم تقييمها من أجل التدريب على تقييم AI وخلق مقالات معيارية لغرض التقييم من قبل النظراء. يجب معاملة كل مسألة بشكلٍ منفصل، وقد أشرنا إلى عدد الأوراق المستلمة من الطلاب التي ينبغي تقييمها. بإمكانك تقييم عدد أكبر من الحد الأدنى المطلوب للأوراق المسلّمة - وسيسهم هذا في تحسين دقة تقييم AI، على الرغم من تخفيض العوائد. كما أن بإمكانك الاطلاع على الدقة الحالية لتقييم AI في صفحة عرض المسائل.

source: Problem List
ar: قائمة المسائل

source: Please note that when you see a submission here, it has been temporarily removed from the grading pool. The submission will return to the grading pool after 30 minutes without any grade being submitted. Hitting the back button will result in a 30 minute wait to be able to grade this submission again.
ar: الرجاء ملاحظة أنه عند حدوث عملية تقديم لورقة ما هنا، فسيتم إزالتها مؤقتا من موضع تجميع الدرجات. كما سيتم لاحقاً إعادتها إلى موضع تجميع الدرجات بعد 30 دقيقةٍ دون تقديم أي درجة عليها. إن الضغط على زر الرجوع سيؤدي إلى الانتظار 30 دقيقة أخرى حتى يمكن تقييم هذه الورقة مرةً ثانية.

source: Prompt
ar: فوري

source: (Hide)
ar: (إخفاء)

source: Student Response
ar: إجابة الطالب

source: Written Feedback
ar: الآراء والملاحظات المكتوبة

source: Feedback for student (optional)
ar: الآراء والملاحظات للطالب (اختياري)

source: Flag as inappropriate content for later review
ar: إعطاء علامة تدل على محتوى غير مناسب لتتم مراجعته في وقت لاحق

source: Skip
ar: تخطي

source: Grade Distribution
ar: توزيع الدرجات

source: Loading problem list...
ar: تحميل قائمة المسائل...

source: Gender Distribution
ar: توزيع الجنسين

source: Level of Education
ar: المستوى التعليمي

source: Course Information
ar: معلومات المقرر

source: Course ID
ar: رقم تعريف المقرر

source: Students Enrolled
ar: الطلاب المسجلون

source: Started
ar: ابتدأ بتاريخ

source: Ended
ar: انتهى بتاريخ

source: Grade Cutoffs
ar: تصنيف الدرجات

source: The status for any active tasks appears in a table below.
ar: حالة أية مهام فعالة تظهر في الجدول أدناه.

source: Course Warnings
ar: أنذارات المقرر

source: Data Download
ar: تنزيل البيانات

source: List enrolled students with profile information
ar: قائمة الطلاب المسجلين مع معلومات الملف الشخصي

source: Grading Configuration
ar: إعدادات التقييم

source: Get Student Anonymized IDs CSV
ar: الحصول على هويات الطلاب غير المعرفة بملف القيم المفصولة بفواصل

source: Back to Standard Dashboard
ar: الرجوع لصفحة المعلومات الرئيسية القياسية.

source: section_display_name
ar: الاسم_المعروض_للقسم

source: Enter student emails separated by new lines or commas.
ar: قم بإدخال عناوين البريد الإلكتروني للطلاب مع فصلها على أسطر مختلفة أو بفواصل.

source: Student Emails
ar: عناوين البريد الإلكتروني للطلاب

source: Enroll
ar: تسجيل

source: Unenroll
ar: إلغاء التسجيل

source: Auto-Enroll
ar: التسجيل-الآلي

source: Auto Enroll
ar: التسجيل الآلي

source: If auto enroll is <em>checked</em>, students who have not yet registered for edX will be automatically enrolled.
ar: في حال كان التسجيل الآلي <em>معتمداً</em> ضمن الاختيارات، فإن الطلاب الذين لم يتم تسجيلهم بعد لـ edX سيتم تسجيلهم تلقائياً فيه.

source: If auto enroll is left <em>unchecked</em>, students who have not yet registered for edX will not be enrolled, but will be allowed to enroll.
ar: في حال كان التسجيل الآلي <em>غير معتمد</em> ضمن الاختيارات، فإن الطلاب الذين لم يتم تسجيلهم بعد لـ edX لن يتم تسجيلهم فيه تلقائياً، لكن يسمح لهم بالتسجيل فيه.

source: Administration List Management
ar: إدارة قائمة الإشراف

source: Getting available lists...
ar: الحصول على القوائم المتاحة...

source: Staff cannot modify staff or beta tester lists. To modify these lists, contact your instructor and ask them to add you as an instructor for staff and beta lists, or a forum admin for forum management.
ar: لا يمكن للطاقم تعديل قوائم الطاقم أو مختبري البرنامج. ولتعديلها الرجاء الاتصال مع الموجّه الخاص بك لطلب إضافتك كموجّه في قوائم الطاقم والاختبار، أو كمشرف على المنتدى بغرض إدارته.

source: Course Staff
ar: طاقم المقرر

source: Course staff can help you manage limited aspects of your course. Staff can enroll and unenroll students, as well as modify their grades and see all course data. Course staff are not automatically given access to Studio and will not be able to edit your course.
ar: بإمكان طاقم المقرر مساعدتك على إدارة جوانب محدودة فقط من مقررك. حيث يستطيع الطاقم تسجيل الطلاب وإلغاء تسجيلهم، بالإضافة إلى تعديل درجاتهم والاطلاع على كافة بيانات المقرر. لكن لا يعطى طاقم المقرر إذن الدخول للاستوديو بشكلٍ تلقائي، ولن يكونوا قادرين على تعديل مقررك.

source: Add Staff
ar: إضافة أعضاء إلى الطاقم

source: Instructors
ar: الموجّهون

source: Instructors are the core administration of your course. Instructors can add and remove course staff, as well as administer forum access.
ar: الموجّهون هم الإدارة الأساسية لمقررك. ويستطيع الموجّهون إضافة وحذف أعضاء من طاقم المقرر، إلى جانب الإشراف على عملية الدخول للمنتدى.

source: Add Instructor
ar: إضافة موجّه

source: Beta Testers
ar: مختبرو البرنامج
