Repository: a-nassif/edraak
Catalog: conf/locale/*/LC_MESSAGES/mako.po
Languages: ar

source: The name on your ID must match the name on your account below
ar: يجب أن يطابق الاسم على بطاقتك الاسم المسجّل على حسابك أدناه

source: Photos don't meet the requirements?
ar: ماذا لو كانت الصور لا تطابق المتطلبات؟

source: Retake Your Photos
ar: يجب إعادة أخذ الصور مرة أخرى

source: Check Your Name
ar: ينبغي التحقق من إسمك

source: Make sure your full name on your edX account ({full_name}) matches your ID. We will also use this as the name on your certificate.
ar: يجب التأكد من مطابقة إسمك بالكامل على حسابك في edX وهو ({full_name}) للإسم على هويتك. وسوف نستخدم نفس الاسم كذلك على الشهادة الممنوحة لك.

source: Edit your name
ar: تعديل إسمك

source: Check Your Contribution Level
ar: تحقق من مستوى مساهمتك

source: Please confirm your contribution for this course (min. $
ar: الرجاء التأكيد على مساهمتك في هذا المقرر (الحد الأدنى $

source: Once you verify your details match the requirements, you can move on to step 4, payment on our secure server.
ar: بمجرد التأكد من مطابقة تفاصيلك للمتطلبات، تستطيع الانتقال لخطوة رقم 4، الدفع على مخدّم موقعنا الآمن.

source: Yes! My details all match.
ar: نعم! جميع التفاصيل مطابقة.

source: Register for {}
ar: قم بالتسجيل في {}

source: You need to activate your edX account before proceeding
ar: عليك تفعيل حساب edX الخاص بك قبل المتابعة

source: Please check your email for further instructions on activating your new account.
ar: الرجاء التحقق من بريدك الإلكتروني وستجد المزيد من التعليمات حول كيفية تفعيل حسابك.

source: What You Will Need to Register
ar: ما الذي ستحتاجه للقيام بالتسجيل

source: There are three things you will need to register as an ID verified student:
ar: هنالك ثلاثة أشياء ستحتاج إليها للتسجيل كطالب معرّف بالبطاقة الشخصية:

source: Activate Your Account
ar: قم بتفعيل حسابك

source: Check your email
ar: تفقد بريدك الإلكتروني

source: you need an active edX account before registering - check your email for instructions
ar: قبل القيام بالتسجيل تحتاج إلى حساب edX مفعّل - تفقد بريدك الإلكتروني لتجد المزيد من التعليمات

source: Identification
ar: التعريف

source: A photo identification document
ar: وثيقة إثبات شخصية باستخدام الصورة

source: a drivers license, passport, or other goverment or school-issued ID with your name and picture on it
ar: رخصة قيادة، جواز سفر، أو أي وثيقة هوية صادرة من الحكومة أو المدرسة تتضمن صورتك وإسمك

source: Webcam
ar: كاميرا الكمبيوتر

source: A webcam and a modern browser
ar: كاميرا كمبيوتر ومتصفح حديث

source: {ff_a_start}Firefox{a_end}, {chrome_a_start}Chrome{a_end}, {safari_a_start}Safari{a_end}, {ie_a_start}IE9+{a_end}
ar: {ff_a_start}فايرفوكس{a_end}، {chrome_a_start}كروم{a_end}، {safari_a_start}سفاري{a_end}، {ie_a_start} IE9 فما فوق{a_end}

source: Please make sure your browser is updated to the most recent version possible
ar: الرجاء التأكد من أن المتصفح الخاص بك محدّث وفق آخر إصدار ممكن

source: Credit or Debit Card
ar: بطاقة الائتمان أو الخصم المباشر

source: A major credit or debit card
ar: بطاقة ائتمان أو خصم مباشر رئيسية

source: Visa, Master Card, American Express, Discover, Diners Club, JCB with Discover logo
ar: فيزا، ماستر كارد، أمريكان إكسبرس، ديسكفر، داينرز كلاب، جي سي بي مع علامة ديسكافر

source: Missing something? You can always {a_start} audit this course instead {a_end}
ar: هل ينقصك أي من المتطلبات السابق ذكرها؟ بإمكانك دائماً {a_start}التسجيل بصفة مستمع في المقرر بدلاً من ذلك{a_end}

source: Go to Step 1: Take my Photo
ar: الذهاب للخطوة 1: أخذ صورة لي

source: ID Verification
ar: التحقق باستخدام البطاقة الشخصية

source: You've Been Verified Previously
ar: لقد تم التحقق من هويتك مسبقاً

source: We've already verified your identity (through the photos of you and your ID you provided earlier). You can proceed to make your secure payment and complete registration.
ar: لقد قمنا بالتحقق من هويتك مسبقاً (عن طريق صورك و بطاقتك التي زودتنا بها سابقاً) تستطيع المتابعة للقيام بالدفع الآمن واستكمال التسجيل.

source: You have decided to pay $
ar: لقد قررت دفع $
