Repository: a-nassif/edraak
Catalog: conf/locale/*/LC_MESSAGES/mako.po
Languages: ar

source: Beta testers can see course content before the rest of the students. They can make sure that the content works, but have no additional privileges.
ar: يمكن لمختبري البرنامج رؤية محتوى المقرر قبل غيرهم من الطلاب، وبذلك يستطيعون التأكد من صحة عمل البرنامج ومن المحتوى، لكنهم لا يملكون صلاحياتٍ إضافية.

source: Beta Tester
ar: مختبر البرنامج

source: Forum Admins
ar: مشرفو المنتدى

source: Forum admins can moderate the course forums as well as administer other forum roles.
ar: يستطيع مشرفو المنتدى مراقبة والإشراف على منتديات المقرر بالإضافة إلى الإشراف على أدوار أخرى في المنتدى.

source: Forum Moderators
ar: وسطاء المنتدى

source: Forum moderators can moderate the course forums. They cannot add other moderators.
ar: يمكن لوسطاء المنتدى مراقبة والإشراف على منتديات المقرر، لكن ليس بإمكانهم إضافة وسطاء آخرين.

source: Add Moderator
ar: إضافة وسيط للمنتدى

source: Forum Community TAs
ar: مساعدو مجتمع المنتدى

source: Community TA's are members of the community whom you deem particularly helpful on the forums.
ar: مساعدو مجتمع المنتدى هم أعضاء من مجتمع المقرر الذين تجدهم مفيدون بشكلٍ خاص في المنتديات.

source: Community TA
ar: مساعد مجتمع المنتدى

source: Student-specific grade inspection
ar: بحث عن درجات طالب معين

source: Student Email or Username
ar: عنوان البريد الإلكتروني واسم المستخدم للطالب

source: Click this link to view the student's progress page:
ar: اضغط على هذا الرابط لمشاهدة صفحة تطور الطالب:

source: Student Progress Page
ar: صفحة تطور الطالب

source: Student-specific grade adjustment
ar: تعديل درجات طالب محدد

source: Problem urlname
ar: عنوان صفحة الإنترنت url للمسألة

source: You may use just the "urlname" if a problem, or "modulename/urlname" if not. (For example, if the location is {location1}, then just provide the {urlname1}. If the location is {location2}, then provide {urlname2}.)
ar: بإمكانك استخدام عنوان صفحة الإنترنت "urlname" فقط لمشكلة، أو عنوان صفحة الإنترنت مع اسم النموذج "modulename/urlname" في الحالات الأخرى. (على سبيل المثال، في حال كان الموقع {location1}، عندها لا يلزم سوى إعطاء {urlname1}. أما إذا كان الموقع {location2}، يجب عند ذلك إعطاء {urlname2}.)

source: Next, select an action to perform for the given user and problem:
ar: تالياً، قم باختيار إجراء يتم أداؤه للمستخدم والمسألة المعطيان:

source: Reset Student Attempts
ar: إعادة ضبط عدد محاولات الطالب

source: Rescore Student Submission
ar: إعادة تقييم ورقة الطالب

source: You may also delete the entire state of a student for the specified problem:
ar: بإمكانك كذلك حذف حالة طالب بالكامل للمسألة المحددة:

source: Delete Student State for Problem
ar: حذف حالة الطالب بالنسبة لمسألة محددة

source: Rescoring runs in the background, and status for active tasks will appear in a table on the Course Info tab. To see status for all tasks submitted for this problem and student, click on this button:
ar: عملية إعادة التقييم تجري في خلفية البرنامج، وستظهر حالة المهام الفعالة في جدول ضمن علامة التبويب الخاصة بمعلومات المقرر. للاطلاع على حالة جميع المهام المقدمة لهذه المسألة والطالب، إضغط على هذا الزر:

source: Show Background Task History for Student
ar: أظهر تاريخ المهام للطالب

source: Then select an action
ar: ثم اختر إجراء

source: Reset ALL students' attempts
ar: أعد ضبط جميع محاولات الطلاب

source: Rescore ALL students' problem submissions
ar: أعد تقييم جميع المسائل التي قام الطلاب بتسليمها

source: These actions run in the background, and status for active tasks will appear in a table on the Course Info tab. To see status for all tasks submitted for this problem, click on this button
ar: تتم هذه الإجراءات في خلفية النظام، وستظهر حالة المهام الفعالة في جدول في تبويب معلومات المقرر. للاطلاع على حالة جميع المهام المقدمة لهذه المسألة، اضغط على هذا الزر.

source: Show Background Task History for Problem
ar: إظهار تاريخ المهام لمسألة معينة

source: None Available
ar: غير متوفر

source: {course_number} Combined Notifications
ar: إشعارات مجموعة {course_number}

source: Open Ended Console
ar: وحدة تحكم مفتوحة النهايات

source: Here are items that could potentially need your attention.
ar: هذه بعض العناصر التي يمكن أن تحتاج اهتماماً خاصاً منك.

source: No items require attention at the moment.
ar: لا يوجد أي عناصر تتطلب اهتماماً خاصاً منك في الوقت الحالي

source: {course_number} Flagged Open Ended Problems
ar: المسائل ذات النهايات المفتوحة المحددة بعلامة في المقرر {course_number}

source: Flagged Open Ended Problems
ar: المسائل ذات النهايات المفتوحة والمحددة بعلامة

source: Here are a list of open ended problems for this course that have been flagged by students as potentially inappropriate.
ar: هذه قائمة بالمسائل ذات النهايات المفتوحة لهذا المقرر والتي تم تحديدها بعلامة من قبل الطلاب على أنها قد تكون غير ملائمة.

source: No flagged problems exist.
ar: لا يوجد مسائل محددة بعلامات.

source: Unflag
ar: إلغاء التحديد

source: Ban
ar: حظر

source: {course_number} Open Ended Problems
ar: المسائل ذات النهايات المفتوحة للمقرر {course_number}

source: Open Ended Problems
ar: المسائل ذات النهايات المفتوحة

source: Here is a list of open ended problems for this course.
ar: هذه قائمة بالمسائل ذات النهايات المفتوحة لهذا المقرر.

source: You have not attempted any open ended problems yet.
ar: لم تحاول حل أي من المسائل ذات النهايات المفتوحة حتى الآن.

source: Problem Name
ar: اسم المسألة

source: Status
ar: حالة

source: Grader Type
ar: نوع المُصحِّح

source: {p_tag}You currently do not having any peer grading to do. In order to have peer grading to do: {ul_tag} {li_tag}You need to have submitted a response to a peer grading problem.{end_li_tag} {li_tag}The instructor needs to score the essays that are used to help you better understand the grading criteria.{end_li_tag} {li_tag}There must be submissions that are waiting for grading.{end_li_tag} {end_ul_tag} {end_p_tag}
ar: {p_tag}ليس لديك حالياً أي تقييمات المطلوب إنجازها لنظرائك. وليكون لديك تقييم تقوم به لنظرائك: {ul_tag} {li_tag}من المطلوب أن تكون قد قمت مسبقاً بتقديم رد لمسألة تتطلب تقييم النظراء.{end_li_tag} {li_tag}ويحتاج الموجّه إلى تقييم وإعطاء درجات على المقالات المستخدمة لمساعدتك على فهم معايير التقييم بشكلٍ أفضل.{end_li_tag} {li_tag}لابد من أن تكون هناك أوراق مقدّمة تنتظر التقييم.{end_li_tag} {end_ul_tag} {end_p_tag}

source: Peer Grading
ar: تقييم النظراء

source: Here are a list of problems that need to be peer graded for this course.
ar: هذه قائمة بالمسائل التي يلزم تقييمها من قبل النظراء في هذا المقرر.

source: Due date
ar: التاريخ المقرر للتسليم

source: Graded
ar: تم تقييمه

source: Available
ar: متاح

source: Required
ar: مطلوب

source: Progress
ar: التطور

source: No due date
ar: لا تاريخ محدد للتسليم

source: The due date has passed, and peer grading for this problem is closed at this time.
ar: لقد مر الموعد المحدد للتسليم، وعملية التقييم من قبل النظراء لهذه المسألة مغلقة حالياً.

source: The due date has passed, and peer grading is closed at this time.
ar: لقد مر الموعد المحدد للتسليم، وعملية التقييم من قبل النظراء مغلقة حالياً.

source: Learning to Grade
ar: تعلُّم التقييم

source: I am unsure about the scores I have given above:
ar: أنا غير متأكد من الدرجات التي أعطيتها أعلاه:

source: Please edit your peer's submission and give them written comments below.
ar: الرجاء تعديل الأوراق المقدّمة من نظرائك وقم بإعطائهم تعليقات مكتوبة أدناه.

source: This is an insertion.
ar: هذا إدراج.

source: This is a deletion.
ar: هذا حذف.

source: [This is a comment.]
ar: [هذا تعليق.]

source: Please include some written feedback as well.
ar: الرجاء إدخال بعض التغذية الراجعة المكتوبة كذلك.

source: This submission has explicit, offensive, or (I suspect) plagiarized content.
ar: تحتوي هذه الورقة المقدّمة على محتوى فاضح، مسيئة، أو (بحسب ما أعتقد) مسروق.

source: How did I do?
ar: كيف كان أدائي؟

source: Continue
ar: استمر

source: Ready to grade!
ar: جاهز للتقييم!

source: You have finished learning to grade, which means that you are now ready to start grading.
ar: لقد انتهيت من تعلم طريقة التقييم، ما يعني أن بإمكانك الآن البدء بالتقييم.

source: Start Grading!
ar: ابدأ التقييم!

source: Learning to grade
ar: تعلم طريقة التقييم

source: You have not yet finished learning to grade this problem.
ar: لم تنهي حتى الآن تعلم طريقة تقييم هذه المسألة.

source: You will now be shown a series of instructor-scored essays, and will be asked to score them yourself.
ar: سيتم إطلاعك الآن على سلسلة من المقالات التي تم تقييمها من قبل الموجِّه، وسيطلب منك تقييمهم بنفسك.

source: Once you can score the essays similarly to an instructor, you will be ready to grade your peers.
ar: لدى تمكنك من تقييم المقالات بطريقة مشابهة لما يقوم به الموجِه، ستكون جاهزاً عندها للقيام بالتقييم لنظرائك.

source: Start learning to grade
ar: ابدأ بتعلم طريقة التقييم

source: Are you sure that you want to flag this submission?
ar: هل أنت متأكد من أنك تود وضع علامة على هذه المادة؟

source: You are about to flag a submission. You should only flag a submission that contains explicit, offensive, or (suspected) plagiarized content. If the submission is not addressed to the question or is incorrect, you should give it a score of zero and accompanying feedback instead of flagging it.
ar: أنت على وشك وضع علامة على مادة مقدّمة. يجب أن لا تقوم بوضع علامة على مادة إلا إذا احتوت على نصوص فاضحة أو مسيئة أو (يعتقد بأنها) مسروقة. إذا كانت المادة المقدّمة لا تتناول الإجابة المناسبة للسؤال أو كانت غير صحيحة، عليك أن تعطيها علامة الصفر وتقوم بإضافة ملاحظات لها بدلاً من تحديدها بعلامة.

source: Remove Flag
ar: أزل التحديد بعلامة

source: Keep Flag
ar: أبق التحديد بعلامة

source: Go Back
ar: العودة

source: Thanks For Registering!
ar: نشكرك على قيامك بالتسجيل!

source: Your account is not active yet. An activation link has been sent to {email}, along with instructions for activating your account.
ar: حسابك غير مفعل حتى الآن. تم إرسال رابط التفعيل لـ {email}، مع التعليمات الخاصة بتفعيل الحساب.

source: Activation Complete!
ar: تم التفعيل!

source: Account already active!
ar: الحساب مفعّل مسبقاً!

source: You can now {link_start}log in{link_end}.
ar: بإمكانك الآن {link_start}تسجيل الدخول{link_end}.

source: Activation Invalid
ar: عملية التفعيل غير صحيحة

source: Something went wrong. Check to make sure the URL you went to was correct -- e-mail programs will sometimes split it into two lines. If you still have issues, e-mail us to let us know what happened at {email}.
ar: حدث خطأ ما. تأكد من صحة العنوان -URL- الذي ذهبت إليه، تقوم برامج البريد الإلكتروني أحياناً بتقسيم العنوان إلى سطرين. في حال مازلت تواجه مشاكل، راسلنا على {email} لإعلامنا بما حدث.

source: Or you can go back to the {link_start}home page{link_end}.
ar: أو بإمكانك العودة لـ {link_start}الصفحة الرئيسية{link_end}.

source: Password reset successful
ar: تمت إعادة ضبط كلمة السر بنجاح

source: We've e-mailed you instructions for setting your password to the e-mail address you submitted. You should be receiving it shortly.
ar: لقد قمنا بإرسال رسالةٍ على عنوان البريد الإلكتروني الذي زودتنا به تتضمن التعليمات الخاصة بضبط كلمة السر، وستصلك قريباً.

source: Payment Error
ar: خطأ في عملية الدفع

source: There was an error processing your order!
ar: لقد حدث خطأ لدى معالجة طلبك!

source: Your Shopping Cart
ar: سلة التسوق الخاصة بك

source: Your selected items:
ar: العناصر المختارة من قبلك:

source: Quantity
ar: الكمية

source: Description
ar: الوصف

source: Unit Price
ar: سعر الوحدة

source: Price
ar: السعر

source: Currency
ar: العملة

source: Total Amount
ar: المبلغ الإجمالي

source: You have selected no items for purchase.
ar: لم تقم باختيار أي عنصر للشراء.

source: Register for [Course Name] | Receipt (Order
ar: قم بالتسجيل في [اسم المقرر] | إيصال (الطلب

source: () Electronic Receipt
ar: إيصال إلكتروني ()

source: Order #
ar: طلبية #

source: Date:
ar: التاريخ:

source: Items ordered:
ar: العناصر المطلوبة:

source: Qty
ar: الكمية

source: Note: items with strikethough like
ar: ملاحظة: العناصر المشطوبة مثل

source: have been refunded.
ar: تم استرداد قيمتها.

source: Billed To:
ar: تم تسجيل الفاتورة لـ:

source: Receipt (Order
ar: الآيصال (الطلب

source: You are now registered for:
ar: أنت الآن مسجل في:

source: Registered as:
ar: مسجل كـ:

source: Your Progress
ar: تطورك

source: Current Step:
ar: الخطوة الحالية:

source: Intro
ar: المقدمة

source: Take Photo
ar: قم بأخذ صورة

source: Take ID Photo
ar: قم بأخذ صورة بطاقة شخصية

source: Review
ar: مراجعة

source: Make Payment
ar: القيام بالدفع

source: Confirmation
ar: تأكيد

source: Congratulations! You are now verified on
ar: مبروك! تم التحقق من هويتك على

source: You are now registered as a verified student! Your registration details are below.
ar: أنت الآن مسجل كطالب معرف! ستجد تفاصيل تسجيلك أدناه.

source: You are registered for:
ar: أنت الآن مسجل لـ:

source: A list of courses you have just registered for as a verified student
ar: قائمة بالمقررات التي قمت بالتسجيل بها كطالب معرّف

source: Options
ar: خيارات

source: Starts: {start_date}
ar: يبدأ بتاريخ: {start_date}

source: Go to Course
ar: اذهب لمقرر

source: Go to your Dashboard
ar: اذهب لصفحة معلوماتك الرئيسية

source: Verified Status
ar: الحالة المعرّفة

source: We have received your identification details to verify your identity. If there is a problem with any of the items, we will contact you to resubmit. You can now register for any of the verified certificate courses this semester without having to re-verify.
ar: لقد وصلتنا تفاصيل التعريف الخاص بك من أجل التحقق من هويتك. إذا كانت هنالك أي مشكلة في أي من العناصر سنقوم بالاتصال بك لتقوم بإعادة التقديم. تستطيع الآن التسجيل لأي من مقررات الشهادات الموثّقة في هذا الفصل الدراسي دون الحاجة لإعادة التعريف.

source: The professor will ask you to periodically submit a new photo to verify your work during the course (usually at exam times).
ar: سيطلب أستاذ المقرر منك القيام بتقديم صورة جديدة دورياً للتحقق من عملك خلال فترة المقرر (عادة ما يكون ذلك في أوقات الامتحان).

source: Payment Details
ar: تفاصيل الدفع

source: Please print this page for your records; it serves as your receipt. You will also receive an email with the same information.
ar: الرجاء طباعة هذه الصفحة للاحتفاظ بها ضمن سجلاتك الخاصة، وستكون بمثابة إيصالك. ستقوم باستلام رسالة بريد إلكتروني أيضاً تحتوي على نفس المعلومات.

source: Order No.
ar: رقم الطلب

source: Date
ar: التاريخ

source: Total
ar: المجموع

source: this
ar: هذا

source: Billed To
ar: تم تسجيل الفاتورة لـ:

source: The page that you were looking for was not found. Go back to the {link_start}homepage{link_end} or let us know about any pages that may have been moved at {email}.
ar: لم يتم إيجاد الصفحة التي كنت تبحث عنها، الرجاء العودة إلى {link_start}الصفحة الرئيسية{link_end}، أو إعلامنا عبر البريد الإلكتروني {link_end} عن أية صفحات يحتمل يكون قد تغير موقعها.

source: Currently the <em>{platform_name}</em> servers are down
ar: مخدّمات منصة <em>{platform_name}</em> متوقّفة حالياً

source: Our staff is currently working to get the site back up as soon as possible. Please email us at <a href="mailto:{tech_support_email}">{tech_support_email}</a> to report any problems or downtime.
ar: يعمل طاقمنا حالياً على إعادة تفعيل الموقع في أقرب وقتٍ ممكن. الرجاء مراسلتنا على البريد الإلكتروني للدعم التقني <a href="mailto:{tech_support_email}">{tech_support_email}</a> للإبلاغ عن أية مشكلات أو أوقات توقّف.

source: There has been a 500 error on the <em>{platform_name}</em> servers
ar: حدث خطأ من فئة 500 على مخدمات منصة <em>{platform_name}</em>

source: Please wait a few seconds and then reload the page. If the problem persists, please email us at <a href="{email}">{email}</a>.
ar: الرجاء الانتظار لبضع ثوانٍ فقط ثم إعادة تحميل الصفحة. في حال استمرت المشكلة، الرجاء مراسلتنا على البريد الإلكتروني <a href="{email}">{email}</a>.

source: Currently the <em>{platform_name}</em> servers are overloaded
ar: تعمل مخدمات المنصة <em>{platform_name}</em> حالياً بحملٍ زائدٍ عن طاقتها

source: Our staff is currently working to get the site back up as soon as possible. Please email us at <a href="mailto:\{tech_support_email}">{tech_support_email}</a> to report any problems or downtime.
ar: يعمل طاقمنا حالياً على إعادة تفعيل الموقع في أقرب وقتٍ ممكن. الرجاء مراسلتنا على البريد الإلكتروني للدعم التقني <a href="mailto:{tech_support_email}">{tech_support_email}</a> للإبلاغ عن أية مشكلات أو أوقات توقّف.

source: edX edge
ar: حافة edX

source: Log in to your courses
ar: تسجيل الدخول لمقرراتك

source: Register for classes
ar: التسجيل للصفوف

source: Take free online courses from today's leading universities.
ar: قم بأخذ مقررات مجانية عبر الانترنت من الجامعات الرائدة في الوقت الراهن.

source: Edit Your Name
ar: تعديل اسمك

source: The following error occured while editing your name:
ar: حدث الخطأ التالي أثناء تعديل اسمك:

source: Change my name
ar: تغيير اسمي:

source: You are registering for
ar: تقوم بالتسجيل لـ

source: Registering as:
ar: تقوم بالتسجيل كـ:

source: Have questions?
ar: هل لديك أسئلة؟

source: Please read {a_start}our FAQs to view common questions about our certificates{a_end}.
ar: الرجاء قراءة {a_start}الأسئلة المتكررة الخاصة بموقعنا للاطلاع على الأسئلة الشائعة لما يتعلق بشهاداتنا{a_end}.

source: Change your mind?
ar: هل غيرت رأيك؟

source: You can always {a_start} audit the course for free {a_end} without verifying.
ar: بإمكانك دائماً {a_start}حضور المقرر بصفة مستمع بالمجان{a_end} دون التحقق.

source: Having Technical Trouble?
ar: هل تواجه مشكلة تقنية؟

source: Please make sure your browser is updated to the {strong_start}{a_start}most recent version possible{a_end}{strong_end}. Also, please make sure your {strong_start}web cam is plugged in, turned on, and allowed to function in your web browser (commonly adjustable in your browser settings).{strong_end}
ar: الرجاء التأكد من تحديث المتصفح الخاص بك إلى {strong_start}{a_start}أحدث إصدار ممكن{a_end}{strong_end}. يرجي أيضاً التأكد من أن {strong_start}كاميرا الكمبيوتر متصلة وفي وضعية التشغيل، ومعدّة للعمل في متصفح الويب الخاص بك (قابلة للتعديل عادة ضمن إعدادات المتصفح الخاص بك). {strong_end}

source: Edit Your Full Name
ar: قم بتعديل اسمك الكامل

source: Register for {} | Verification
ar: قم بالتسجيل في {} | التحقق

source: No Webcam Detected
ar: لم يتم التعرف على كاميرا كمبيوتر

source: You don't seem to have a webcam connected. Double-check that your webcam is connected and working to continue registering, or select to {a_start} audit the course for free {a_end} without verifying.
ar: الظاهر عدم وجود كاميرا كمبيوتر متصلة بجهازك. قم بالتأكد من أن الكاميرا متصلة وتعمل بشكلٍ جيد من أجل الاستمرار بعملية التسجيل، أو اختر {a_start} التسجيل كمستمع مجاناً {a_end} دون عملية التحقق.

source: No Flash Detected
ar: لم يتم التحقق من وجود ذاكرة فلاش

source: You don't seem to have Flash installed. {a_start} Get Flash {a_end} to continue your registration.
ar: يبدو أنه لا يوجد لديك ذاكرة فلاش مركّبة. {a_start} احصل على ذاكرة فلاش {a_end} للاستمرار في عملية التسجيل.

source: Error processing your order
ar: حدث خطأ أثنا ءمعالجة طلبك!

source: Oops! Something went wrong. Please confirm your details again and click the button to move on to payment. If you are still having trouble, please try again later.
ar: للأسف! حدث خطأ ما. الرجاء تأكيد تفاصيلك مرة أخرى والضغط على الزر للانتقال لصفحة الدفع. في حال كنت لا تزال تعاني من بعض المشكلات، الرجاء إعادة المحاولة في وقتٍ لاحق.

source: Take Your Photo
ar: قم بأخذ صورة

source: Use your webcam to take a picture of your face so we can match it with the picture on your ID.
ar: استخدم كاميرا الكمبيوتر الخاصة بك لأخذ صورة لوجهك حتى نتمكن من مطابقتها مع الصورة على بطاقتك الشخصية.

source: Don't see your picture? Make sure to allow your browser to use your camera when it asks for permission.
ar: لا يمكنك رؤية صورتك؟ قم بالتحقق من إمكانية استخدام متصفحك للكاميرا الخاصة بك عندما يطلب الإذن منك.

source: Retake
ar: إعادة التصوير

source: Take photo
ar: قم بأخذ صورة

source: Looks good
ar: تم بشكلٍ جيد

source: Tips on taking a successful photo
ar: نصائح حول كيفية أخذ صورة ناجحة

source: Make sure your face is well-lit
ar: قم بالتأكد من الإضاءة الجيدة على وجهك

source: Be sure your entire face is inside the frame
ar: قم بالتأكد من أن وجهك بالكامل داخل الإطار

source: Can we match the photo you took with the one on your ID?
ar: هل يمكننا مطابقة الصورة التي أخذتها مع الصورة على بطاقتك الشخصية؟

source: Once in position, use the camera button
ar: عندما تكون في الوضع المناسب، قم باستخدام زر الكاميرا

source: to capture your picture
ar: لأخذ صورتك

source: Use the checkmark button
ar: استخدم زر العلامة

source: once you are happy with the photo
ar: لدى رضائك عن الصورة التي أخذتها

source: Common Questions
ar: أسئلة شائعة

source: Why do you need my photo?
ar: لماذا تحتاجون صورتي؟

source: As part of the verification process, we need your photo to confirm that you are you.
ar: نحتاج صورتك كجزء من عملية التحقق وذلك للتأكد من هويتك.

source: What do you do with this picture?
ar: ماذا تفعلون بهذه الصورة؟

source: We only use it to verify your identity. It is not displayed anywhere.
ar: نقوم باستعمالها فقط للتحقق من هويتك، ولن يتم عرضها في أي مكان آخر.

source: What if my camera isn't working?
ar: ماذا إذا لم تعمل الكاميرا الخاصة بي؟

source: Once you verify your photo looks good, you can move on to step 2.
ar: بمجرد رضاك عن جودة صورتك يمكنك الانتقال لخطوة 2.

source: Go to Step 2: Take ID Photo
ar: اذهب للخطوة 2: قم بأخذ صورة بطاقة شخصية

source: Show Us Your ID
ar: أرنا بطاقتك الشخصية

source: Use your webcam to take a picture of your ID so we can match it with your photo and the name on your account.
ar: استخدم كاميرا الكمبيوتر الخاصة بك لأخذ صورة لبطاقتك الشخصية حتى نستطيع مطابقتها مع صورتك والاسم المستخدم على حسابك.

source: Make sure your ID is well-lit
ar: قم بالتأكد من أن بطاقتك مضاءة بشكل جيد

source: Check that there isn't any glare
ar: تأكد من عدم وجود أي لمعان أو وهج

source: Ensure that you can see your photo and read your name
ar: تأكد من قدرتك على رؤية صورتك وقراءة اسمك

source: Try to keep your fingers at the edge to avoid covering important information
ar: حاول إبقاء أصابعك على الحافة لتفادي تغطية معلومات مهمة

source: Acceptable IDs include drivers licenses, passports, or other goverment-issued IDs that include your name and photo
ar: بطاقات التعريف الشخصية المقبولة تتضمن رخصة القيادة، أو جوازات السفر أو أي بطاقة تعريف صادرة عن الحكومة تحتوي على اسمك وصورتك

source: to capture your ID
ar: لأخذ صورة لبطاقتك

source: Why do you need a photo of my ID?
ar: لماذا تحتاجون صورة عن بطاقتي؟

source: We need to match your ID with your photo and name to confirm that you are you.
ar: نحتاج لمطابقة هويتك مع صورتك وإسمك بالبطاقة الشخصية للتحقق من شخصك.

source: We encrypt it and send it to our secure authorization service for review. We use the highest levels of security and do not save the photo or information anywhere once the match has been completed.
ar: نقوم بتشفيرها وإرسالها للمراجعة في خدمة التوثيق الآمنة التابعة لنا. نحن نستعمل أقصى مستويات الأمان ولا نقوم بحفظ الصورة أو المعلومات في أي مكان بمجرد استكمال عملية المطابقة.

source: Once you verify your ID photo looks good, you can move on to step 3.
ar: يمكنك الانتقال لخطوة 3 حال التأكد من جودة صورة بطاقتك ورضاك عنها.

source: Go to Step 3: Review Your Info
ar: انتقل للخطوة 3: مراجعة معلوماتك

source: Verify Your Submission
ar: التحقق من المادة المقدّمة

source: Make sure we can verify your identity with the photos and information below.
ar: التأكد من أننا نستطيع تأكيد هويتك من الصور والمعلومات أدناه.

source: Review the Photos You've Taken
ar: مراجعة الصور التي أخذتها

source: Please review the photos and verify that they meet the requirements listed below.
ar: الرجاء مراجعة الصور والتأكد من مطابقتها المتطلبات المذكورة أدناه.

source: The photo above needs to meet the following requirements:
ar: يجب أن تطابق الصورة أعلاه المتطلبات التالية:

source: Be well lit
ar: أن تكون مضاءة جيداً

source: Show your whole face
ar: أن تظهر وجهك بالكامل

source: The photo on your ID must match the photo of your face
ar: أن تطابق الصورة على بطاقتك الشخصية صورة وجهك.

source: Be readable (not too far away, no glare)
ar: أن تكون مقروءة (ليست بعيدة جداً، ودون وهج)
