Repository: a-nassif/edraak
Catalog: conf/locale/*/LC_MESSAGES/mako.po
Languages: ar

source: View the Live Version
ar: الاطلاع على النسخة على الانترنت

source: Add New Component
ar: إضافة عنصر جديد

source: Common Problem Types
ar: الأنواع الشائعة من المسائل

source: Advanced
ar: متقدمة

source: Unit Settings
ar: إعدادات الوحدة

source: Visibility:
ar: من يستطيع رؤيتها:

source: Public
ar: عام

source: Private
ar: خاص

source: This unit has been published. To make changes, you must {link_start}edit a draft{link_end}.
ar: لقد تم نشر هذه الوحدة. إجراء أية تعديلات،عليك {link_start} تعديل المسودة {link_end}.

source: This is a draft of the published unit. To update the live version, you must {link_start}replace it with this draft{link_end}.
ar: هذه مسودة من الوحدة المنشورة. لتحديث النسخة الظاهرة على الإنترنت، عليك {link_start} استبدالها بهذه المسوّدة{link_end}.

source: This unit is scheduled to be released to <strong>students</strong>
ar: من المقرر إصدار هذه الوحدة لـ <strong> الطلاب </strong>

source: on {date}
ar: بتاريخ {date}

source: with the subsection {link_start}{name}{link_end}
ar: مع القسم الفرعي {link_start}{name}{link_end}

source: Delete Draft
ar: حذف المسودة

source: Unit Location
ar: موقع الوحدة

source: Unit Identifier:
ar: رمز تعريف الوحدة

source: Thank you for signing up for edX Studio! To activate your account, please copy and paste this address into your web browser's address bar:
ar: نشكرك على التسجيل في استوديو edX! لتفعيل حسابك، الرجاء نسخ ولصق العنوان التالي في شريط العنوان لمتصفح الانترنت الخاص بك:

source: If you didn't request this, you don't need to do anything; you won't receive any more email from us. Please do not reply to this e-mail; if you require assistance, check the help section of the edX web site.
ar: في حال لم تقم بطلب هذا، ليس عليك أن تقوم بأي شيء، ولن يصلك أي رسائل إلكترونية مجدداً من قبلنا. الرجاء عدم الرد على هذه الرسالة، وإذا احتجت إلى مساعدة، قم بزيارة قسم المساعدة الخاص بموقع edX.

source: Your account for edX Studio
ar: حساب استوديو edX الخاص بك

source: {email} has requested Studio course creator privileges on edge
ar: طلب {email} صلاحيات صاحب المقرر في برنامج استوديو

source: User '{user}' with e-mail {email} has requested Studio course creator privileges on edge.
ar: قام المستخدم '{user}' صاحب البريد الالكتروني {email} بطلب صلاحيات صاحب المقرر في الاستوديو.

source: To grant or deny this request, use the course creator admin table.
ar: للموافقة على الطلب ومنح الصلاحيات أو رفضها، يجب استعمال جدول مشرف المقرر.

source: Your request for course creation rights to edX Studio have been denied. If you believe this was in error, please contact:
ar: تم رفض طلبك الحصول على حقوق إنشاء مقررات في استوديو edX. إذا كنت تعتقد بوجود خطأ ما، الرجاء الاتصال بـ:

source: Your request for course creation rights to edX Studio have been granted. To create your first course, visit:
ar: تمت الموافقة على منحك حقوق إنشاء مقررات في استوديو edX. لإنشاء مقررك الأول، قم بزيارة:

source: Your course creation rights to edX Studio have been revoked. If you believe this was in error, please contact:
ar: تم إلغاء حقوقك في إنشاء مقررات في استوديو edX. إذا كنت تعتقد بوجود خطأٍ ما، الرجاء الاتصال بـ:

source: Your course creator status for edX Studio
ar: حالة صاحب المقرر الخاصة بك في استوديو edX

source: Thanks for activating your account.
ar: نشكرك على تفعيل حسابك.

source: This account has already been activated.
ar: تم تفعيل هذا الحساب في وقتٍ سابق.

source: Visit your {link_start}dashboard{link_end} to see your courses.
ar: قم بزيارة {link_start} صفحة المعلومات الرئيسية الخاصة بك {link_end} لرؤية مقرراتك.

source: You can now {link_start}login{link_end}.
ar: بإمكانك الآن {link_start} تسجيل الدخول {link_end}.

source: An activation link has been sent to {emaiL}, along with instructions for activating your account.
ar: تم إرسال رابط للتفعيل على {emaiL}، مع تعليمات تفعيل الحساب.

source: All rights reserved.
ar: جميع الحقوق محفوظة.

source: Contact Us
ar: للاتصال بنا

source: Current Course:
ar: المقرر الحالي:

source: {course_name}'s Navigation:
ar: تصفح course_name}'s}:

source: Course
ar: المقرر

source: Outline
ar: المخطط الكلي

source: Updates
ar: التحديثات

source: Schedule &amp; Details
ar: الجدول والتفاصيل

source: Checklists
ar: قوائم المراجعة

source: Import
ar: استيراد

source: Export
ar: تصدير

source: Help &amp; Account Navigation
ar: المساعدة وتصفح الحساب

source: Help
ar: المساعدة

source: This is a PDF Document
ar: هذه وثيقة بصيغة PDF

source: Studio Documentation
ar: التوثيق الخاص ببرنامج استوديو

source: Studio Help Center
ar: مركز مساعدة برنامج استوديو

source: Currently signed in as:
ar: حالياً الدخول مسجَل كـ:

source: Sign Out
ar: تسجيل الخروج

source: You're not currently signed in
ar: لم تقم بتسجيل الدخول بعد

source: How Studio Works
ar: كيفية عمل برنامج استوديو؟

source: Studio Help
ar: المساعدة الخاصة ببرنامج استوديو

source: Visual
ar: مرئي

source: Launch Latex Source Compiler
ar: تشغيل برنامج تحويل برامج لغة البرمجة لاتكس

source: Heading 1
ar: العنوان الرئيسي 1

source: Multiple Choice
ar: اختيار واحد من عدة خيارات

source: Checkboxes
ar: مربعات الاختيارات المتعددة

source: Text Input
ar: مدخلات نصيّة

source: Numerical Input
ar: مدخلات رقمية

source: Dropdown
ar: القائمة المنسدلة

source: Explanation
ar: الإيضاح

source: Advanced Editor
ar: المحرر المتقدم

source: Toggle Cheatsheet
ar: صفحة الغش القابلة للإظهار/الإخفاء

source: Looking for Help with Studio?
ar: هل تبحث عن مساعدة في برنامج استديو؟

source: edX Studio Help
ar: المساعدة الخاصة ببرنامج استوديو edX

source: Need help with Studio? Creating a course is complex, so we're here to help. Take advantage of our documentation, help center, as well as our edX101 introduction course for course authors.
ar: هل تحتاج مساعدة في استعمال برنامج استوديو؟ إن وضع مقررٍ ما هو أمرٌ معقد، لذلك فنحن هنا للمساعدة. استفد من التوثيق الكامل الذي نوفّره، ومن مركز المساعدة، وأيضاً من مقرر edX101 التمهيدي لمؤلفي المقررات.

source: Download Studio Documentation
ar: تنزيل وثائق برنامج استوديو

source: How to use Studio to build your course
ar: كيفية استعمال برنامج استوديو لبناء مقررك

source: Enroll in edX101
ar: التسجيل في مقرر edX101

source: Contact us about Studio
ar: اتصل بنا بخصوص برنامج استوديو

source: Have problems, questions, or suggestions about Studio? We're also here to listen to any feedback you want to share.
ar: هل يوجد لديك مشاكل، أسئلة، أو اقتراحات تتعلق ببرنامج استوديو؟ نحن هنا أيضاً للاستماع لأي آراء أو ملاحظات من قبلك تود مشاركتها.

source: name
ar: الاسم

source: Register for {} | Choose Your Track
ar: قم بالتسجيل في {} | قم باختيار المسار الخاص بك

source: Sorry, there was an error when trying to register you
ar: للأسف، لقد حدث خطأ أثناء محاولة تسجيلك.

source: Select your track:
ar: اختر المسار الخاص بك:

source: Certificate of Achievement (ID Verified)
ar: شهادة الإنجازات (تم التحقق من الهوية)

source: Sign up and work toward a verified Certificate of Achievement.
ar: قم بالتسجيل وابدأ العمل في سبيل الحصول على شهادة إنجازات معتمدة.

source: Select your contribution for this course (min. $
ar: اختر مساهمتك في هذا المقرر (الحد الأدنى $

source: Why do I have to pay? What if I don't meet all the requirements?
ar: لماذا علي أن أدفع؟ ماذا إن لم تنطبق علي كافة المتطلبات؟

source: Why do I have to pay?
ar: لماذا علي أن أدفع؟

source: As a not-for-profit, edX uses your contribution to support our mission to provide quality education to everyone around the world, and to improve learning through research. While we have established a minimum fee, we ask that you contribute as much as you can.
ar: كمؤسسة غير ربحية، تقوم edx باستعمال مساهمتك لدعم مهمتنا التي تتمثّل في توفير تعليم عالي الجودة للجميع حول العالم، ولتطوير عملية التعلم عن طريق البحث. وفي حين أننا قمنا بفرض الحد الأدنى كرسم تسجيل، إلا أننا نطلب لطفاً مساهمتك على قدر الاستطاعة.

source: I'd like to pay more than the minimum. Is my contribution tax deductible?
ar: أود دفع مبلغٍ سزسد عن الحد الأدنى. هل يتم خصم مساهمتي من الضرائب؟

source: Please check with your tax advisor to determine whether your contribution is tax deductible.
ar: الرجاء مراجعة استشاري الضرائب الخاص بك لمعرفة ما إذا كانت مساهمتك قابلة للخصم من الضرائب.

source: What if I can't afford it or don't have the necessary equipment?
ar: ماذا إن كنت لا أستطيع تحمل تكاليفه أو أنني لا أملك المعدات اللازمة؟

source: If you can't afford the minimum fee or don't meet the requirements, you can audit the course or elect to pursue an honor code certificate at no cost. If you would like to pursue the honor code certificate, please check the honor code certificate box, tell us why you can't pursue the verified certificate below, and then click the 'Select Certificate' button to complete your registration.
ar: إذا كنت لا تستطيع تحمل الحد الأدنى من الرسوم أو أنك لا تلبي متطلبات البرنامج، تستطيع حضور المقرر كمستمع أو قد تختار تحصيل شهادة ميثاق شرفية دون أية تكاليف. إذا أحببت أن تحصل على شهادة ميثاق شرفية، الرجاء اختيار مربع شهادة الميثاق الشرفية في الطلب، وإعلامنا بأسباب عدم قدرتك على السعي للحصول على الشهادة أدناه، و من ثم إضغط زر "اختيار الشهادة" لإكمال عملية التسجيل.

source: Select Honor Code Certificate
ar: اختر شهادة ميثاق شرف

source: Explain your situation:
ar: إشرح ظروفك:

source: Please write a few sentences about why you'd like to opt out of the paid verified certificate to pursue the honor code certificate:
ar: الرجاء كتابة بعض الجمل لتوضيح أسباب رغبتك الانسحاب من خيار الشهادة المدفوعة المعتمدة والتوجه للحصول على شهادة ميثاق الشرف:

source: Verified Registration Requirements
ar: متطلبات التسجيل المعتمدة

source: To register for a Verified Certificate of Achievement option, you will need a webcam, a credit or debit card, and an ID.
ar: للتسجيل لخيار شهادة إنجازات معتمدة، ستكون بحاجة لكاميرا الكمبيوتر، وبطاقة ائتمان أو بطاقة خصم فوري، وهوية شخصية.

source: What is an ID Verified Certificate?
ar: ما هي الشهادة الموثقة بالهوية؟

source: An ID Verified Certificate requires proof of your identity through your photo and ID and is checked throughout the course to verify that it is you who earned the passing grade.
ar: الشهادة الموثقة بالهوية تتطلب إثباتاً لهويتك عن طريق صورتك وبطاقتك الشخصية، ويتم التحقق منها طوال فترة المقرر للتأكد من كونك أنت من تمكن من نيل علامة النجاح.

source: or
ar: أو

source: Audit This Course
ar: أدخل هذا المقرر كمستمع

source: Sign up to audit this course for free and track your own progress.
ar: قم بالتسجيل لدخول هذا المقرر كمستمع بشكلٍ مجاني وقم بمتابعة تطورك.

source: {platform_name}-wide Summary
ar: {platform_name}- ملخص كلي

source: Instructions
ar: التعليمات

source: Collapse Instructions
ar: تصغير شاشة التعليمات

source: Guided Discussion
ar: نقاش موجّه

source: Hide Annotations
ar: إخفاء الحواشي

source: Vision
ar: الرؤية

source: Faq
ar: الأسئلة المتكررة

source: Press
ar: الصحافة

source: Contact
ar: معلومات الاتصال

source: Class Feedback
ar: الآراء والملاحظات الواردة من الصف

source: We are always seeking feedback to improve our courses. If you are an enrolled student and have any questions, feedback, suggestions, or any other issues specific to a particular class, please post on the discussion forums of that&nbsp;class.
ar: آراؤكم وملاحظاتكم تهمنا دائماً من أجل تطوير مقرراتنا. إذا كنت طالباً مسجَلاً وكانت لديك أية أسئلة، آراء وملاحظات، اقتراحات، أو أية شؤون أخرى تتعلق بأي من فصولنا، الرجاء القيام بنشرها على منتديات المناقشة الخاصة بذلك الفصل nbsp;class&

source: General Inquiries and Feedback
ar: استفسارات عامة وآراء وملاحظات

source: If you have a general question about {platform_name} please email <a href="mailto:{contact_email}">{contact_email}</a>. To see if your question has already been answered, visit our {faq_link_start}FAQ page{faq_link_end}. You can also join the discussion on our {fb_link_start}facebook page{fb_link_end}. Though we may not have a chance to respond to every email, we take all feedback into consideration.
ar: إذا كان لديك سؤالاً عاماً عن {platform_name} الرجاء إرسال رسالة بريد إلكتروني إلى <a href="mailto:{contact_email}">{contact_email}</a>. وللتحقق من ما إذا كان سؤالك قد تمت الإجابة عليه مسبقاً، قم بزيارة {faq_link_start}صفحة الأسئلة المتكررة{faq_link_end}. بإمكانك كذلك الانضمام إلى نقاشنا على {fb_link_start}صفحتنا على موقع فيسبوك{fb_link_end}. وعلى الرغم من أننا قد لا نتمكن من الإجابة على كافة الرسائل الإلكترونية، إلا أننا نأخذ كافة الآراء والملاحظات الواردة بعين الاعتبار.

source: Technical Inquiries and Feedback
ar: الاستفسارات التقنية والآراء والملاحظات

source: If you have suggestions/feedback about the overall {platform_name} platform, or are facing general technical issues with the platform (e.g., issues with email addresses and passwords), you can reach us at <a href="mailto:{tech_email}">{tech_email}</a>. For technical questions, please make sure you are using a current version of Firefox or Chrome, and include browser and version in your e-mail, as well as screenshots or other pertinent details. If you find a bug or other issues, you can reach us at the following: <a href="mailto:{bugs_email}">{bugs_email}</a>.
ar: إذا كانت لديك اقتراحات/آراء وملاحظات على منصة {platform_name} ككل، أو كنت تواجه قضايا تقنية عامة تتعلق بالمنصة (أي على سبيل المثال مشكلاتٍ تتعلق بعناوين البريد الإلكتروني وكلمات السر)، بإمكانك مراسلتنا على <a href="mailto:{tech_email}">{tech_email}</a>. للأسئلة ذات الطبيعة التقنية، الرجاء التأكد من كونك تستخدم النسخة الأحدث من متصفح فايرفوكس أو كروم، وإرسال نوع المتصفح ونسخته في رسالة البريد الإلكتروني، بالإضافة إلى أية صورة مأخوذة عن شاشة الكمبيوتر توضح المشكلة المعنية، أو أية تفاصيل أخرى تتعلق بها. في حال اكتشفت خطأً برمجياً أو مشكلات أخرى، بإمكانك الاتصال بنا على العنوان التالي: <a href="mailto:{bugs_email}">{bugs_email}</a>.

source: Media
ar: وسائل الإعلام

source: Please visit our {link_start}media/press page{link_end} for more information. For any media or press inquiries, please email {email}.
ar: الرجاء زيارة {link_start} صفحة وسائل الإعلام/ الصحافة على موقعنا {link_end} لمزيدٍ من المعلومات. لأي استفسارات خاصة بوسائل الإعلام أو الصحافة، الرجاء إرسال رسالة إلكترونية إلى {email}.

source: Universities
ar: الجامعات

source: If you are a university wishing to collaborate with or if you have questions about {platform_name}, please email {email}.
ar: إذا كنت ممثّلاً عن جامعة تود التعاون معنا، أو كانت لديك أسئلة عن {platform_name}، الرجاء إرسال رسالة إلكترونية إلى {email}.

source: New
ar: جديد

source: Dashboard
ar: صفحة المعلومات الرئيسية

source: You'll receive a confirmation in your in-box. Please click the link in the email to confirm the email change.
ar: ستصلك رسالة تأكيد على البريد الوارد الخاص بك. الرجاء الضغط على الرابط في الرسالة لتأكيد تغيير البريد الإلكتروني.

source: edit
ar: تعديل

source: Email
ar: البريد الإلكتروني

source: Reset Password
ar: إعادة تعيين كلمة السر

source: Current Courses
ar: المقررات الحالية

source: Looks like you haven't registered for any courses yet.
ar: يبدو أنك لم تقم بالتسجيل في أي من المقررات حتى الآن.

source: Find courses now!
ar: قم بإيجاد المقررات الآن!

source: Looks like you haven't been enrolled in any courses yet.
ar: يبدو أنك لم تقم بالتسجيل في أيٍ من المقررات حتى الآن.

source: Course-loading errors
ar: أخطاء في تحميل المقرر

source: Email Settings for {course_number}
ar: إعدادات البريد الإلكتروني لـ {course_number}

source: Receive course emails
ar: استلام الرسائل الإلكترونية الخاصة بالمقرر

source: Save Settings
ar: حفظ الإعدادات

source: Close Modal
ar: إغلاق النموذج

source: Are you sure you want to unregister from {course_number}?
ar: هل أنت متأكد من رغبتك بإلغاء تسجيلك في {course_number}؟

source: Unregister
ar: إلغاء التسجيل

source: Password Reset Email Sent
ar: تم إرسال البريد الإلكتروني الخاص بإعادة ضبط كلمة السر

source: An email has been sent to {email}. Follow the link in the email to change your password.
ar: تم إرسال رسالة إلكترونية لـ {email}. قم بتتبع الرابط في الرسالة من أجل تغيير كلمتك السرية.

source: Change Email
ar: تغيير البريد الإلكتروني

source: Please enter your new email address:
ar: الرجاء إدخال عنوان بريدك الإلكتروني الجديد:

source: Please confirm your password:
ar: الرجاء تأكيد كلمة المرور الخاصة بك:

source: We will send a confirmation to both {email} and your new email as part of the process.
ar: سنقوم بإرسال رسالة تأكيد إلى كلٍ من {email} وعنوان بريدك الإلكتروني الجديد أيضاً.

source: Change your name
ar: تغيير اسمك

source: To uphold the credibility of {platform} certificates, all name changes will be logged and recorded.
ar: حرصاً على مصداقية شهادات {platform}، سيتم تدوين وتسجيل جميع التغييرات في الأسماء.

source: Enter your desired full name, as it will appear on the {platform} certificates:
ar: قم بإدخال الاسم الكامل كما تريده أن يظهر على جميع شهادات الـ {platform}:

source: Reason for name change:
ar: أسباب تغيير الاسم:

source: Change My Name
ar: تغيير اسمي

source: E-mail change failed
ar: لم تتم عملية تغيير عنوان البريد الإلكتروني بنجاح

source: We were unable to send a confirmation email to {email}
ar: لم نتمكن من إرسال رسالة تأكيد إلى البريد الإلكتروني {email}

source: Go back to the {link_start}home page{link_end}.
ar: العودة لـ {link_start} الصفحة الرئيسية {link_end}

source: E-mail change successful!
ar: تمت عملية تغيير عنوان البريد الإلكتروني بنجاح!

source: You should see your new email in your {link_start}dashboard{link_end}.
ar: سيظهر عنوان بريدك الإلكتروني الجديد في {link_start} صفحة المعلومات الرئيسية {link_end}. الخاصة بك.

source: An account with the new e-mail address already exists.
ar: هنالك حساب موجود مسبقاً بالعنوان الإلكتروني الجديد.

source: Student Enrollment Form
ar: نموذج تسجيل الطالب

source: Course:
ar: المقرر:

source: Add new students
ar: إضافة طلاب جدد

source: Existing students:
ar: الطلاب الحاليون:

source: New students added:
ar: الطلاب الجدد المضافون:

source: Students rejected:
ar: طلاب تم رفضهم:

source: Debug:
ar: تصحيح الأخطاء:

source: foo
ar: فو

source: bar
ar: شريط

source: biff
ar: نظام التنبيه بيف

source: External Authentication failed
ar: فشلت عملية المصادقة الخارجية

source: Due:
ar: موعد التسليم:

source: Status:
ar: الحالة:

source: You have successfully gotten to level {goal_level}.
ar: لقد وصلت لمستوى {goal_level} بنجاح.

source: You have not yet gotten to level {goal_level}.
ar: لم تصل إلى مستوى {goal_level} حتى الآن.

source: Completed puzzles
ar: الألغاز المستكملة

source: Level
ar: المستوى

source: Submitted
ar: تم تقديمه

source: Puzzle Leaderboard
ar: قائمة المتصدِرين في اللغز

source: User
ar: المستخدم

source: Score
ar: النتيجة

source: About
ar: نبذة عن

source: Jobs
ar: الوظائف

source: FAQ
ar: الأسئلة المتكررة

source: {platform_name} is a non-profit created by founding partners {Harvard} and {MIT} whose mission is to bring the best of higher education to students of all ages anywhere in the world, wherever there is Internet access. {platform_name}'s free online MOOCs are interactive and subjects include computer science, public health, and artificial intelligence.
ar: {platform_name} هي منشأة غير ربحية تم تأسيسها من قبل الشركاء {Harvard} و{MIT}، الذين تتمثّل مهمتهم في تقديم أفضل مستويات الدراسات العليا وجعلها في متناول الطلاب من جميع الأعمار وفي أي مكان في العالم يتوفّر فيه الاتصال بالإنترنت. إن مقررات {platform_name} الضخمة المتاحة عبر الإنترنت والمقدّمة بشكلٍ مجاني هي مقررات تفاعلية، وتشمل عدة مواد من ضمنها علوم الحاسوب، الصحة العامة، و الذكاء الاصطناعي.

source: &copy; 2013 {platform_name}, some rights reserved.
ar: &copy; 2013 {platform_name}, بعض الحقوق محفوظة.

source: Terms of Service and Honor Code
ar: شروط الاستخدام وميثاق الشرف

source: Privacy Policy
ar: سياسة الخصوصية

source: Password Reset
ar: إعادة ضبط كلمة السر

source: Please enter your e-mail address below, and we will e-mail instructions for setting a new password.
ar: الرجاء إدخال عنوان بريدك الإلكتروني أدناه، وسنقوم بإرسال تعليمات ضبط كلمة سر جديدة إليه.

source: Required Information
ar: معلومات مطلوبة

source: Your E-mail Address
ar: عنوان بريدك الإلكتروني

source: This is the e-mail address you used to register with {platform}
ar: هذا هو عنوان البريد الإلكتروني الذي استخدمته للتسجيل في {platform}

source: Reset My Password
ar: إعادة ضبط كلمة السر الخاصة بي

source: Email is incorrect.
ar: عنوان البريد الإلكتروني غير صحيح

source: {platform_name} Help
ar: المساعدة الخاصة بمنصة {platform_name}

source: {span_start}{platform_name}{span_end} Help
ar: {span_start}{platform_name}{span_end} المساعدة

source: For <strong>questions on course lectures, homework, tools, or materials for this course</strong>, post in the {link_start}course discussion forum{link_end}.
ar: <strong>للأسئلة المتعلقة بمحاضرات المقرر، والواجبات المطلوبة، والأدوات، أو المواد الخاصة بهذا المقرر</strong>، قم بنشر أسئلتك في {link_start}منتدى النقاش الخاص بالمقرر{link_end}.

source: Have <strong>general questions about {platform_name}</strong>? You can find lots of helpful information in the {platform_name} {link_start}FAQ{link_end}.
ar: لديك أسئلة عامة تتعلق بـ {platform_name}</strong>؟ بإمكانك أن تجد الكثير من المعلومات المفيدة في صفحة {platform_name} {link_start}الأسئلة المتكررة{link_end}.

source: Have a <strong>question about something specific</strong>? You can contact the {platform_name} general support team directly:
ar: لديك <strong>سؤالٌ حول أمرٍ محدد</strong>؟ بإمكانك الاتصال مباشرةً مع فريق الدعم العام لـ{platform_name}:

source: Report a problem
ar: الإبلاغ عن مشكلة

source: Make a suggestion
ar: تقديم اقتراح

source: Ask a question
ar: طرح سؤال

source: Name*
ar: الاسم*

source: E-mail*
ar: البريد الإلكتروني*

source: Briefly describe your issue*
ar: شرح مختصر للموضوع*

source: Tell us the details*
ar: أخبرنا بالتفاصيل*

source: Include error messages, steps which lead to the issue, etc
ar: قم بتضمين رسائل الخطأ التي تظهر، والخطوات التي تقود للمشكلة، الخ

source: Thank You!
ar: شكراً لك!

source: Thank you for your inquiry or feedback. We typically respond to a request within one business day (Monday to Friday, {open_time} UTC to {close_time} UTC.) In the meantime, please review our {link_start}detailed FAQs{link_end} where most questions have already been answered.
ar: نشكرك على تقديم طلبك أو إعطاء آرائك وملاحظاتك. نقوم عادةً بالرد على الطلب في غضون يوم عملٍ واحد (الاثنين للأحد، {open_time} UTC to {close_time} التوقيت العالمي المنسّق). وفي هذه الأثناء، الرجاء القيام بمراجعة {link_start} الأسئلة المتكررة المفصلة {link_end} حيث ستجد إجابات لغالبية الأسئلة المطروحة.

source: Free courses from <strong>{university_name}</strong>
ar: دورات مجانية من <strong>{university_name}</strong>

source: The Future of Online Education
ar: مستقبل التعليم عبر الإنترنت

source: For anyone, anywhere, anytime
ar: لأي شخص، في أي مكان، و في أي وقت

source: Stay up to date with all {platform_name} has to offer!
ar: إبق على اطلاع على جميع ما تقدّمه {platform_name} !

source: Explore free courses from {span_start}{platform_name}{span_end} universities
ar: اطّلع على المقررات المجانية من جامعات {span_start}{platform_name}{span_end}

source: Invalid email change key
ar: مفتاح تغيير البريد الإلكتروني غير صحيح

source: This e-mail key is not valid. Please check:
ar: مفتاح البريد الإلكتروني هذا غير فعال، الرجاء التحقق منه:

source: Was this key already used? Check whether the e-mail change has already happened.
ar: هل تم استعمال هذا المفتاح من قبل؟ الرجاء التحقق من تغيّر البريد الإلكتروني فعلياً.

source: Did your e-mail client break the URL into two lines?
ar: هل قام برنامج البريد الإلكتروني الخاص بك بتقسيم عنوان URL على سطرين؟

source: The keys are valid for a limited amount of time. Has the key expired?
ar: المفاتيح صالحة لمدة محدودة فقط. هل انتهت صلاحية المفتاح؟

source: Log into your {platform_name} Account
ar: قم بتسجيل الدخول إلى حسابك في {platform_name}

source: Log into My {platform_name} Account
ar: تسجيل الدخول في حسابي على {platform_name}

source: Access My Courses
ar: الدخول لمقرراتي

source: Please log in
ar: الرجاء تسجيل الدخول

source: to access your account and courses
ar: للوصول لحسابك ومقرراتك

source: We're Sorry, {platform_name} accounts are unavailable currently
ar: نعتذر لكون حسابات {platform_name} غير متاحة حالياً

source: The following errors occured while logging you in:
ar: حدثت الأخطاء التالية أثناء محاولة تسجيل دخولك:
