Repository: a-nassif/edraak
Catalog: conf/locale/*/LC_MESSAGES/mako.po
Languages: ar

source: Page Not Found
ar: هذه الصفحة غير موجودة

source: Page not found
ar: هذه الصفحة غير موجودة

source: The page that you were looking for was not found.
ar: الصفحة التي تبحث عنها غير موجودة

source: Go back to the {homepage} or let us know about any pages that may have been moved at {email}.
ar: عُد إلى {homepage}، أو قم بإعلامنا برسالة {email} عن أي صفحاتٍ يُحتمل أن تكون قد نُقلت.

source: Studio Server Error
ar: خطأ في خادم الاستوديو

source: The <em>Studio</em> servers encountered an error
ar: خوادم <em>الاستوديو</em> واجهت خطأ ما.

source: An error occurred in Studio and the page could not be loaded. Please try again in a few moments.
ar: حدث خطأ في الاستوديو مما أدى إلى عدم تحميل الصفحة. الرجاء المحاولة بعد قليل.

source: We've logged the error and our staff is currently working to resolve this error as soon as possible.
ar: لقد قمنا بتسجيل الخطأ، ويعمل فريقنا الآن على إيجاد حل لهذا الخطأ في أقرب وقت ممكن.

source: If the problem persists, please email us at {email}.
ar: في حال استمرت المشكلة الرجاء مراسلتنا عبر البريد الإلكتروني على العنوان التالي {email}

source: Studio Account Activation
ar: تفعيل حساب الاستوديو

source: Your account is already active
ar: حسابك مفعل مسبقاً

source: This account, set up using {0}, has already been activated. Please sign in to start working within edX Studio.
ar: تم بالفعل تفعيل هذا الحساب، الذي تم إنشاؤه باستخدام {0}. الرجاء تسجيل الدخول للبدء في العمل ضمن برنامج استديو EDX.

source: Sign into Studio
ar: تسجيل الدخول لاستوديو

source: Your account activation is complete!
ar: تم استكمال عملية تفعيل حسابك!

source: Thank you for activating your account. You may now sign in and start using edX Studio to author courses.
ar: نشكرك على تفعيل حسابك. بإمكانك الآن تسجيل الدخول و البدء باستعمال استوديو edX لتأليف المقررات.

source: Your account activation is invalid
ar: عملية تفعيل حسابك غير صحيحة

source: We're sorry. Something went wrong with your activation. Check to make sure the URL you went to was correct &mdash; e-mail programs will sometimes split it into two lines.
ar: نعتذر بسبب حدوث خطأٍ ما أثناء عملية تفعيل حسابك. الرجاء التأكد من صحة العنوان -URL- الذي ذهبت إليه، حيث تقوم أحياناً برامج البريد الإلكتروني بتقسيم العنوان على سطرين.

source: If you still have issues, contact edX Support. In the meatime, you can also return to
ar: في حال استمرت المشكلات، الرجاء الاتصال بفريق دعم edX. يمكنك في هذه الأثناء العودة إلى

source: Contact edX Support
ar: اتصل بفريق دعم edX

source: Files &amp; Uploads
ar: الملفات والتحميل

source: Content
ar: المحتوى

source: Page Actions
ar: خيارات الصفحة

source: Upload New File
ar: تحميل ملف جديد

source: List of uploaded files and assets in this course
ar: قائمة بالملفات والموجودات المحملة ضمن هذا المقرر

source: Preview
ar: المعاينة

source: Name
ar: الاسم

source: Date Added
ar: تاريخ الإضافة

source: URL
ar: عنوان صفحة الإنترنت

source: Actions
ar: الإجراءات

source: What files are included here?
ar: ما الملفات المشمولة هنا؟

source: Any file you upload to the course will be listed here, including your course image, textbook chapters, and any files you add directly to this page.
ar: أي ملف تقوم بتحميله إلى المقرر سيتم إدراجه هنا، بما في ذلك صورة المقرر، والفصول من كتب المقرر، و أية ملفات تقوم بإضافتها إلى هذه الصفحة مباشرةً.

source: What can I do on this page?
ar: ما الذي يمكنني فعله على هذه الصفحة؟

source: You can click the file name to view or download the file, upload a new file, delete a file, and lock a file to prevent people who are not enrolled from accessing that specific file. You can also copy the location (URL) of a file to use elsewhere in your course.
ar: بإمكانك الضغط على اسم الملف لاستعراضه أو تحميله على جهازك، أو تحميل ملفٍ جديدٍ من جهازك، أو حذف ملف، أو إقفال ملف لمنع من هو غير مسجل من الدخول إلى هذا الملف تحديداً. بإمكانك كذلك نسخ موقع (عنوان صفحة الإنترنت URL) لملف معين لاستخدامه في مكانٍ آخر في مقررك.

source: close
ar: إغلاق

source: Choose File
ar: اختيار الملف

source: Your file has been deleted.
ar: تم حذف ملفك.

source: close alert
ar: إغلاق التنبيه

source: Tools
ar: الأدوات

source: Course Checklists
ar: قوائم المراجعة الخاصة بالمقرر التعليمي

source: Current Checklists
ar: قوائم المراجعة الحالية

source: What are checklists?
ar: ما هي قوائم المراجعة؟

source: Running a course on edX is a complex undertaking. Course checklists are designed to help you understand and keep track of all the steps necessary to get your course ready for students.
ar: إدارة مقرر تعليمي على edX هي مهمة معقد. لذا فإن لوائح المراجعة الخاصة بالمقرر مصممة لمساعدتك على فهم و تتبع جميع الخطوات اللازمة لتجهيز المقرر للطلاب.

source: These checklists are shared among your course team, and any changes you make are immediately visible to other members of the team and saved automatically.
ar: لوائح المراجعة هذه مشتركة مع فريقك في المقرر، و أي تغييرات تقوم بها يمكن لباقي الفريق رؤيتها فوراً ويتم حفظها.

source: Editor
ar: محرر

source: Settings
ar: إعدادات

source: Save
ar: حفظ

source: Cancel
ar: إلغاء

source: Edit
ar: تعديل

source: Delete
ar: حذف

source: Drag to reorder
ar: إسحب لإعادة الطلب

source: Course Updates
ar: تحديثات المساق

source: New Update
ar: تحديث جديد

source: Course updates are announcements or notifications you want to share with your class. Other course authors have used them for important exam/date reminders, change in schedules, and to call out any important steps students need to be aware of.
ar: تحديثات المقرر هي عبارة عن إعلانات أو إشعارات تريد مشاركتها مع صفك. بعض الناشرين الآخرين استعملوا التحديثات كوسيلة للتذكير بالمواعيد المهمة من امتحانات أو تواريخ، أي تغيير في الجدول، و أيضاً لإعلان أي خطوات مهمة على الطلاب أن يكونوا على علم بها.

source: Static Pages
ar: صفحات المحتوى الثابت

source: New Page
ar: صفحة جديدة

source: Static Pages are additional pages that supplement your Courseware. Other course authors have used them to share a syllabus, calendar, handouts, and more.
ar: الصفحات الثابتة هي عبارة عن صفحات إضافية تكمّل منهاجك التعليمي. وقد استخدمها مؤلفو المقررات الآخرون لنشر المنهاج، والتقويم، وأوراق متعلّقة بالمنهاج، وغير ذلك من مواد.

source: How do Static Pages look to students in my course?
ar: كيف تبدو الصفحات الثابتة لطلابي في المقرر؟

source: How Static Pages are Used in Your Course
ar: كيف يتم استعمال الصفحات الثابتة في مقرّرك الدراسي

source: Preview of how Static Pages are used in your course
ar: نظرة عامة عن كيفية استخدام الصفحات الثابتة في مقررك

source: These pages will be presented in your course's main navigation alongside Courseware, Course Info, Discussion, etc.
ar: سيتم توفير هذه الصفحات في قائمة التصفّح الرئيسية الخاصة بمقرّرك إلى جانب المنهاج، ومعلومات المقرّر، والنقاشات،... الخ

source: close modal
ar: أغلاق النموذج

source: CMS Subsection
ar: نظام إدارة المقرر - قسم فرعي

source: Display Name:
ar: الاسم المعروض:

source: Units:
ar: الوحدات:

source: Subsection Settings
ar: إعدادات القسم الفرعي

source: Release Day
ar: تاريخ الإطلاق

source: Release Time
ar: وقت الإطلاق

source: Coordinated Universal Time
ar: التوقيت العالمي المنسق

source: UTC
ar: التوقيت العالمي المنسق

source: The date above differs from the release date of {name}, which is unset.
ar: يختلف التاريخ أعلاه عن تاريخ الإصدار لـ{name}، والذي لم يتم ضبطه.

source: The date above differs from the release date of {name} - {start_time}
ar: يختلف التاريخ أعلاه عن تاريخ الإصدار لـ {name} - {start_time}

source: Sync to {name}.
ar: المزامنة مع {name}.

source: Graded as:
ar: تم تقييمه بدرجة:

source: Not Graded
ar: لم يتم تقييمه

source: Set a due date
ar: تحديد تاريخ التسليم

source: Due Day
ar: يوم التسليم

source: Due Time
ar: وقت التسليم

source: Remove due date
ar: إلغاء تاريخ التسليم

source: Preview Drafts
ar: معاينة المسودات

source: View Live
ar: عرض مباشر

source: Internal Server Error
ar: خطأ داخلي في المخدّم

source: The Page You Requested Page Cannot be Found
ar: لا يمكن إيجاد الصفحة المطلوبة

source: We're sorry. We couldn't find the Studio page you're looking for. You may want to return to the Studio Dashboard and try again. If you are still having problems accessing things, please feel free to {link_start}contact Studio support{link_end} for further help.
ar: نعتذر لعدم تمكنّنا من إيجاد صفحة الاستوديو التي تبحث عنها. قد ترغب في الرجوع لصفحة المعلومات الخاصة بالاستوديو وإعادة المحاولة. إذا استمرت مشكلة الوصول للصفحات، الرجاء {link_start} الاتصال مع فريق دعم الاستوديو {link_end} للمساعدة.

source: Use our feedback tool, Tender, to share your feedback
ar: استخدام أداة الآراء والملاحظات لدينا، ’تندر‘، للإسهام بملاحظاتك

source: The Server Encountered an Error
ar: واجه المخدّم خطأً معيّناً

source: We're sorry. There was a problem with the server while trying to process your last request. You may want to return to the Studio Dashboard or try this request again. If you are still having problems accessing things, please feel free to {link_start}contact Studio support{link_end} for further help.
ar: نعتذر بسبب حدوث خطأ في المخدّم أثناء محاولة إجراء طلبك الأخير. قد ترغب بالعودة إلى صفحة المعلومات الرئيسية الخاصة بالاستوديو أو بإعادة هذا الطلب مرة أخرى. في حال استمرت مشكلة الوصول إلى الصفحات الرجاء {link_start} الاتصال مع فريق دعم الاستوديو {link_end} للمساعدة.

source: Back to dashboard
ar: العودة لصفحة المعلومات الرئيسية

source: Course Export
ar: تصدير المقرر

source: About Exporting Courses
ar: عن تصدير المقررات

source: When exporting your course, you will receive a .tar.gz formatted file that contains the following course data:
ar: عند تصدير المقرر، سيصلك ملف بصيغة tar.gz. يحتوي على البيانات التالية للمقرر:

source: Course Structure (Sections and sub-section ordering)
ar: بنية المقرر (ترتيب الأقسام والأقسام الفرعية)

source: Individual Units
ar: الوحدات المنفردة

source: Individual Problems
ar: المشكلات المنفردة

source: Course Assets
ar: الموجودات الخاصّة بالمقرر

source: Your course export <strong>will not include</strong>: student data, forum/discussion data, course settings, certificates, grading information, or user data.
ar: ملف تصدير المقرّر الخاص بك <strong> لن يتضمن </strong>: بيانات الطالب، بيانات المنتدى/النقاش، إعدادات المقرّر، الشهادات، معلومات التقييم، أو بيانات المستخدم.

source: Export Course:
ar: تصدير المقرر:

source: Download Files
ar: تنزيل الملفات

source: Welcome
ar: مرحباً

source: Welcome to
ar: مرحباً بك في

source: Studio helps manage your courses online, so you can focus on teaching them
ar: يساعدك الاستوديو على إدارة مقرراتك عبر الإنترنت، مما يمكّنك من التركيز على عملية إعطاء هذه المقرّرات

source: Studio's Many Features
ar: الميّزات المتعددة الخاصة بالاستوديو

source: Studio Helps You Keep Your Courses Organized
ar: يساعدك الاستوديو على إبقاء مقرراتك منظّمة على النحو الأفضل

source: Keeping Your Course Organized
ar: إبقاء المقرر الخاص بك منظماً

source: The backbone of your course is how it is organized. Studio offers an <strong>Outline</strong> editor, providing a simple hierarchy and easy drag and drop to help you and your students stay organized.
ar: إن الأساس الأهم بالنسبة لمقررك هو كيفية تنظيمه. ويوفر الاستوديو برنامج تحرير <strong> للمخطط الكلي </strong>، يقدّم بنية هرميّة بسيطة، مع ميزة السحب والإسقاط لتحريك المكونات، لمساعدتك وطلابك على إبقاء كل المواد منظمة.

source: Simple Organization For Content
ar: تنظيم بسيط للمحتوى

source: Studio uses a simple hierarchy of <strong>sections</strong> and <strong>subsections</strong> to organize your content.
ar: يعتمد الاستوديو بنية هرميّة بسيطة من <strong> الأقسام </strong> و <strong> الأقسام الفرعية </strong> من أجل تنظيم المحتوى الخاص بك

source: Change Your Mind Anytime
ar: غيّر رأيك في أي وقت

source: Draft your outline and build content anywhere. Simple drag and drop tools let your reorganize quickly.
ar: قم بإنشاء المخطّط الكلي وبناء محتواك في أي مكان. تساعد أدوات السحب والإسقاط البسيطة في سرعة تعديل التنظيم .

source: Go A Week Or A Semester At A Time
ar: بإمكانك اختيار العمل على أسبوع واحد أو فصل كامل في كل مرة

source: Build and release <strong>sections</strong> to your students incrementally. You don't have to have it all done at once.
ar: بناء وإصدار <strong> الأقسام </strong> للطلاب تدريجيّاً، دون الحاجة إلى إنشاء المحتوى بأكمله مرةً واحدة.

source: Learning is More than Just Lectures
ar: التعلّم هو أكثر من مجرّد محاضرات

source: Studio lets you weave your content together in a way that reinforces learning &mdash; short video lectures interleaved with exercises and more. Insert videos and author a wide variety of exercise types with just a few clicks.
ar: يتيح لك الاستوديو تكوين محتواك وربطه معاً بطريقة تعزز التعلّم mdash &؛ كما يمكنك إدخال تسجيلات فيديو قصيرة لمحاضراتٍ تتخللها تمارين وغير ذلك. وتستطيع كذلك إدخال تسجيلات فيديو وتأليف مجموعة واسعة من أنواع التمارين بعدد قليل من النقرات.

source: Create Learning Pathways
ar: وضع مسارات تعلّم

source: Help your students understand a small interactive piece at a time with multimedia, HTML, and exercises.
ar: ساعد طلابك على فهم جزءٍ تفاعليٍ صغير في كل مرة من خلال استعمال الوسائط المتعددة، والتمارين، وصفحات HTML.

source: Work Visually, Organize Quickly
ar: اعتمد التعليم بالوسائل المرئية، ونظم المحتوى بطريقةٍ سريعة

source: Work visually and see exactly what your students will see. Reorganize all your content with drag and drop.
ar: اعتمد التعليم بالوسائل المرئية وشاهد تماماً ما سيشاهده طلابك. قم بإعادة تنظيم محتواك بالكامل من خلال استخدام ميزة السحب والإسقاط.

source: A Broad Library of Problem Types
ar: مكتبة عريضة من أنواع المسائل

source: It's more than just multiple choice. Studio has nearly a dozen types of problems to challenge your learners.
ar: لا تقتصر نوعية التمارين على مجرد الاختيار من متعدد. يعطيك الاستوديو عشرات الأنواع من المسائل تحدّد من خلالها فهم طلابك للمقرّر.

source: Studio Gives You Simple, Fast, and Incremental Publishing. With Friends.
ar: يعطيك الاستوديو طريقة نشر سهلة، وسريعة، وتراكمية مع الأصدقاء.

source: Simple, Fast, and Incremental Publishing. With Friends.
ar: آلية نشر بسيطة، وسريعة وتراكمية مع الأصدقاء.

source: Studio works like web applications you already know, yet understands how you build curriculum. Instant publishing to the web when you want it, incremental release when it makes sense. And with co-authors, you can have a whole team building a course, together.
ar: يعمل الاستوديو بالطريقة ذات التي تعمل بها تطبيقات الانترنت التي تعرفها، إلا أنه يفهم طريقة بناء المادة التعليمية. ويتيح لك النشر الفوري على الإنترنت عندما ترغب بذلك، وإصدار أجزاء المقرر بشكلٍ تدريجي عندما يكتمل إعدادها بشكلٍ معقول. ومع خاصية ’المؤلفين المشاركين‘ يصبح بالإمكان جعل فريقٍ كامل يعمل معاً على بناء المقرر.

source: Instant Changes
ar: تغييرات فورية

source: Caught a bug? No problem. When you want, your changes to live when you hit Save.
ar: اكتشفت خطأً ما؟ لا يوجد مشكلة، حيث تظهر جميع تعديلاتك على الإنترنت مباشرة بمجرد نقرك خيار ’الحفظ‘.

source: Release-On Date Publishing
ar: النشر أو الإصدار في تاريخٍ معين

source: When you've finished a <strong>section</strong>, pick when you want it to go live and Studio takes care of the rest. Build your course incrementally.
ar: عند انتهائك من إعداد <strong> قسمٍ </strong> ما، قم باختيار تاريخ نشر هذا القسم على الإنترنت وسيتولى الاستوديو المهمة. قم ببناء مقررك بشكلٍ تدريجي.

source: Work in Teams
ar: العمل في فِرَق

source: Co-authors have full access to all the same authoring tools. Make your course better through a team effort.
ar: يستطيع المؤلفون المشاركون الوصول لكافة أدوات التأليف ذاتها واستخدامها. ارفع جودة مقررك من خلال توظيف الجهود المتكاملة للفريق.

source: Sign Up for Studio Today!
ar: قم بالتسجيل في الاستوديو اليوم!

source: Sign Up &amp; Start Making an edX Course
ar: قم بالتسجيل &amp؛ وابدأ ببناء مقرّر باستخدام edX

source: Already have a Studio Account? Sign In
ar: لديك حساب استوديو بالفعل؟ قم بتسجيل الدخول

source: Outlining Your Course
ar: وضع المخطّط العام للمقرر

source: Simple two-level outline to organize your couse. Drag and drop, and see your course at a glance.
ar: مخطّط كلي بسيط من مستويين لتنظيم المقرر. قم باستخدام خاصيّة السحب والإسقاط، وشاهد مقرّرك بلمحةٍ سريعة.

source: More than Just Lectures
ar: أكثر من مجرد محاضرات

source: Quickly create videos, text snippets, inline discussions, and a variety of problem types.
ar: قم بصورةٍ سريعة بإعداد مقاطع فيديو، ومقتطفات نصية، ونقاشات ضمنية، ومجموعة من مختلف أنواع المسائل.

source: Publishing on Date
ar: النشر في التاريخ المحدّد

source: Simply set the date of a section or subsection, and Studio will publish it to your students for you.
ar: قم بكل بساطة بتحديد تاريخ نشر القسم أو القسم الفرعي، وسيتولى الاستوديو نشرَه لطلابك في اليوم المحدد.

source: Course Import
ar: استيراد مقرر

source: You may import existing course structure and content into Studio.
ar: بإمكانك استيراد هيكل ومحتوى مقرر موجود مسبقاً إلى برنامج الاستوديو.

source: Importing is not something to take lightly as the course content you successfully upload will be integrated into your course content and cannot be reversed.
ar: عملية الاستيراد هامة لا يجب الاستهتار بها، حيث سيتم دمج المحتوى الذي تقوم بتحميله بنجاح بمحتوى مقررك ولا يمكن عكس هذه العملية.

source: During the initial stages of the import process, please do not navigate away from this page.
ar: الرجاء عدم التنقل بعيداً من هذه الصفحة خلال المراحل الأولية من عملية النقل.

source: Select a File (.tar.gz format) to Replace Your Course Content
ar: قم باختيار ملف (بصيغة .tar.gz) ليحل محل محتوى مقررك

source: File Chosen:
ar: الملف الذي تم اختياره:

source: Replace my course with the one above
ar: استبدال مقرّري بالمقرّر أعلاه

source: Course Import Status
ar: حالة استيراد المقرر

source: Uploading
ar: جاري التحميل

source: Transferring your file to our servers
ar: نقل ملفك لمخدّماتنا

source: Unpacking
ar: تفريغ

source: Expanding and preparing folder/file structure (You can now leave this page safely, but avoid making drastic changes to content until this import is complete)
ar: توسيع وإعداد هيكل الملف (بإمكانك الآن ترك هذه الصفحة دون أية مشكلة، لكن تجنب عمل تغييرات جذرية على المحتوى حتى تستكمل عملية الاستيراد)

source: Verifying
ar: التحقق

source: Reviewing semantics, syntax, and required data
ar: استعراض الدلالات، القواعد اللغوية، والبيانات المطلوبة

source: Updating Course
ar: تحديث المقرر

source: Integrating your imported content into this course. This may take a while with larger courses.
ar: يتم دمج المحتوى الذي قمت باستيراده في هذا المقرر. قد يستغرق ذلك وقتاً مع المقررات الكبيرة.

source: Success
ar: تمت بنجاح

source: Your imported content has now been integrated into this course
ar: تم الآن دمج المحتوى الذي قمت باستيراده في هذا المقرر

source: View Updated Outline
ar: استعراض المخطط العام المحدّث

source: Gzipped Tar Files (.tar.gz) Only
ar: الملفات بصيغة Gzipped Tar (.tar.gz) حصراً

source: File uploads must be gzipped tar files (.tar.gz) containing, at a minimum, a {filename} file.
ar: يجب أن تكون الملفات المحمَلة بصيغة (gzipped tar (.tar.gz، وتحتوي على الأقل على ملف {filename}.

source: Warning: Auto-generated Nodes
ar: تحذير: عقد تم إنشاؤها تلقائياً

source: Please note that if your course has any problems with auto-generated {nodename} nodes, re-importing your course could cause the loss of student data associated with those problems.
ar: الرجاء أخذ العلم بأنه في حال وجود أية مشكلات في مقررك بالنسبة {nodename} للعقد التي يتم إنشاؤها تلقائياً، فإن إعادة استيراد المقرّر قد تسبّب فقدان جميع بيانات الطالب المرتبطة بهذه المشكلات.

source: There was an error during the upload process.
ar: حدث خطأ أثناء عملية التحميل.

source: There was an error while unpacking the file.
ar: حدث خطأ أثناء عملية تفريغ الملف.

source: There was an error while verifying the file you submitted.
ar: حدث خطأ أثناء عملية التحقق من الملف الذي قمت بتقديمه.

source: There was an error while importing the new course to our database.
ar: حدث خطأ خلال عملية استيراد المقرر الجديد إلى قاعدة البيانات لدينا.

source: Your import has failed.
ar: لقد فشلت عملية الاستيراد

source: Choose new file
ar: اختيار ملف جديد

source: Your import is in progress; navigating away will abort it.
ar: جاري تنفيذ عملية الاستيراد؛ تصفحك إلى موقعٍ مختلف سيؤدي إلى إيقاف العملية.

source: My Courses
ar: مقرراتي

source: New Course
ar: مقرر جديد

source: Email staff to create course
ar: إرسال بريد الكتروني لفريق العمل لإنشاء مقرر

source: Welcome, {0}!
ar: مرحباً، {0}!

source: Here are all of the courses you currently have access to in Studio:
ar: ستجد هنا قائمة بجميع المقررات التي لديك صلاحية الدخول عليها في الاستوديو:

source: You currently aren't associated with any Studio Courses.
ar: أنت حالياً غير مرتبط بأي من مقررات الاستوديو.

source: Please correct the highlighted fields below.
ar: الرجاء تصحيح الحقول المبينة أدناه.

source: Create a New Course
ar: إنشاء مقرر جديد

source: Required Information to Create a New Course
ar: المعلومات المطلوبة لإنشاء مقرر جديد

source: Course Name
ar: اسم المقرر

source: e.g. Introduction to Computer Science
ar: مثال مقدمة لعلوم الكمبيوتر

source: The public display name for your course.
ar: الاسم العلني المعروض لمقررك.

source: Organization
ar: المؤسسة

source: e.g. MITX or IMF
ar: مثال MITX or IMF

source: The name of the organization sponsoring the course
ar: اسم المنظمة الراعية للمقرر

source: Note: No spaces or special characters are allowed. This cannot be changed.
ar: ملاحظة: المسافات أو الأحرف الخاصة غير مسموح بها، ولا يمكن تغييرذلك.

source: Course Number
ar: رقم المقرر

source: e.g. CS101
ar: مثال CS101

source: The unique number that identifies your course within your organization
ar: الرقم الفريد المرتبط بمقررك ضمن مؤسستك

source: Course Run
ar: تشغيل المقرر

source: e.g. 2013_Spring
ar: مثال 2013_Spring

source: The term in which your course will run
ar: الفصل الذي سيجري مقررك ضمنه

source: Create
ar: إنشاء

source: Organization:
ar: المؤسسة:

source: Course Number:
ar: رقم المقرر:

source: Course Run:
ar: مجرى المقرر:

source: Are you staff on an existing Studio course?
ar: هل أنت ضمن طاقم أي من مقررات الاستوديو؟

source: You will need to be added to the course in Studio by the course creator. Please get in touch with the course creator or administrator for the specific course you are helping to author.
ar: في برنامج الاستديو، يجب أن تتم إضافتك إلى المقرر من قبل صاحب المقرر الذي قم بإنشائه. الرجاء الاتصال به أو بالمشرف على المقرر المعيّن الذي تقوم بالمساعدة في تأليفه.

source: Create Your First Course
ar: إنشاء مقررك الأول

source: Your new course is just a click away!
ar: مقررك الجديد هو على بعد نقرة واحدة فقط !

source: Becoming a Course Creator in Studio
ar: كيف تصبح صاحب المقرر في الاستوديو

source: edX Studio is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by edX. Our team will evaluate your request and provide you feedback within 24 hours during the work week.
ar: EDX استوديو هو حل برمجي مستضاف نوفّره لشركاء xConsortium وللضيوف المحددين. تظهر المقررات التي كنت عضواً في فريق إنشائها في الأعلى وبإمكانك تعديلها، في الأثناء التي يتم خلالها منح امتيازات صاحب المقرر من قبل EDX. سيقوم فريقنا بتقييم طلبك وإعطائك إجابةً بشأنه في غضون 24 ساعة خلال أسبوع العمل.

source: Your Course Creator Request Status:
ar: حالة الطلب الذي تقدمت به لتسجيلك كصاحب المقرر:

source: Request the Ability to Create Courses
ar: طلب صلاحية إنشاء المقررات

source: Your Course Creator Request Status
ar: حالة الطلب الذي تقدمت به لتسجيلك كصاحب المقرر

source: edX Studio is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by edX. Our team is has completed evaluating your request.
ar: EDX استوديو هو حل برمجي مستضاف نوفّره لشركاء xConsortium وللضيوف المحددين. تظهر المقررات التي كنت عضواً في فريق إنشائها في الأعلى وبإمكانك تعديلها، في الأثناء التي يتم خلالها منح امتيازات صاحب المقرر من قبل EDX. لقد أنهى فريقنا عملية تقييم طلبك.

source: Your Course Creator request is:
ar: طلب صاحب المقرر الذي تقدمت به:

source: Denied
ar: مرفوض
