Repository: a-nassif/edraak
Catalog: conf/locale/*/LC_MESSAGES/mako.po
Languages: ar

source: Your email or password is incorrect
ar: عنوان بريدك الإلكتروني أو كلمة السر غير صحيحين

source: Please provide the following information to log into your {platform_name} account. Required fields are noted by <strong class="indicator">bold text and an asterisk (*)</strong>.
ar: الرجاء إدخال المعلومات التالية لتتمكن من الدخول إلى حسابك في {platform_name}. تم تحديد الحقول الإلزامية باستخدام <strong class="indicator">الأحرف الغامقة وإشارة النجمة (*)</strong>.

source: E-mail
ar: عنوان البريد الإلكتروني

source: Account Preferences
ar: التفضيلات الخاصة بالحساب

source: Remember me
ar: حفظ بيانات تسجيل الدخول

source: Helpful Information
ar: معلومات مفيدة

source: Login via OpenID
ar: تسجيل الدخول باستخدام الهوية المفتوحة OpenID

source: You can now start learning with {platform_name} by logging in with your <a rel="external" href="http://openid.net/">OpenID account</a>.
ar: بإمكانك الآن أن تبدأ التعلّم عبر {platform_name} من خلال تسجيل الدخول باستخدام <a rel="external" href="http://openid.net/">حسابك في الهوية المفتوحة OpenID</a>.

source: Not Enrolled?
ar: غير مسجَل؟

source: Sign up for {platform_name} today!
ar: قم بالتسجيل في {platform_name} اليوم!

source: Looking for help in logging in or with your {platform_name} account?
ar: هل تحتاج إلى مساعدة في تسجيل الدخول إلى حسابك على {platform_name}؟

source: View our help section for answers to commonly asked questions.
ar: قم بالاطلاع على قسم المساعدة لتجد الإجابات على الأسئلة الشائعة.

source: Log In
ar: تسجيل الدخول

source: Not enrolled?
ar: غير مسجَل؟

source: Sign up.
ar: التسجيل في الموقع.

source: login via openid
ar: تسجيل الدخول باستخدام الهوية المفتوحة

source: Home
ar: الصفحة الرئيسية

source: This page features MathJax technology to render mathematical formulae. To make math accessibile, we suggest using the MathPlayer plugin. Please visit the {link_start}MathPlayer Download Page{link_end} to download the plugin for your browser.
ar: تتميز هذه الصفحة بتوظيف تكنولوجيا MathJax لتكوين الصيغ الرياضية. وللتمكّن من استخدام الميزات الخاصة بالرياضيات، نقترح استخدام البرنامج المساعد MathPlayer. الرجاء زيارة {link_start}صفحة تنزيل MathPlayer {link_end} لتحميل البرنامج المساعد للمتصفح الخاص بك.

source: Your browser does not support the MathPlayer plugin. To use MathPlayer, please use Internet Explorer 6 through 9.
ar: المتصفح الخاص بك لا يدعم البرنامج المساعد MathPlayer. لاستخدام MathPlayer، الرجاء استعمال Internet Explorer النسخ 6 إلى 9.

source: There has been an error on the <em>{platform_name}</em> servers
ar: حدث خطأ على مخدّمات منصة <em>{platform_name}</em>

source: We're sorry, this module is temporarily unavailable. Our staff is working to fix it as soon as possible. Please email us at <a href="mailto:{tech_support_email}">{tech_support_email}</a> to report any problems or downtime.
ar: نأسف لكون هذه الوحدة غير متوفرة مؤقتاً. جاري العمل حالياً على إصلاح الخطأ في أقرب وقتٍ ممكن. الرجاء مراسلتنا عبر البريد الإلكتروني <a href="mailto:{tech_support_email}">{tech_support_email}</a> للإبلاغ عن أية مشكلات أو فترة تعطّل.

source: Details
ar: التفاصيل

source: Error:
ar: خطأ:

source: Raw data:
ar: البيانات الأولية:

source: Accepted
ar: مقبول

source: Error
ar: خطأ

source: Rejected
ar: مرفوض

source: Pending name changes
ar: تغييرات معلّقة في الاسم

source: Confirm
ar: تأكيد

source: Global Navigation
ar: روابط تصفح متطابقة في كافة صفحات الموقع

source: Find Courses
ar: إيجاد المقررات

source: Dashboard for:
ar: صفحة المعلومات الرئيسية لـ:

source: More options dropdown
ar: قائمة منسدلة لخيارات إضافية

source: Log Out
ar: تسجيل الخروج

source: How it Works
ar: كيفية العمل

source: Courses
ar: المقررات

source: Schools
ar: المدارس

source: Register Now
ar: قم بالتسجيل الآن

source: Log in
ar: تسجيل الدخول

source: <strong>Warning:</strong> Your browser is not fully supported. We strongly recommend using {chrome_link_start}Chrome{chrome_link_end} or {ff_link_start}Firefox{ff_link_end}.
ar: تحذير: المتصفح الذي تستخدمه غير مدعوم بشكل كامل، نوصي بشدة باستعمال {chrome_link_start}كروم{chrome_link_end} أو {ff_link_start}فايرفوكس{ff_link_end}.

source: My Notes
ar: ملاحظاتي

source: Tags: {tags}
ar: بطاقات التعريف: {tags}

source: Author: {username}
ar: المؤلف: {username}

source: Created: {datetime}
ar: تاريخ الإنشاء: {datetime}

source: Source: {link}
ar: المصدر: {link}

source: You do not have any notes.
ar: لا يوجد لديك أية ملاحظات.

source: Reset
ar: إعادة الضبط

source: Show Answer(s)
ar: إظهار الإجابة (الإجابات)

source: (for question(s) above - adjacent to each field)
ar: (للسؤال (الأسئلة) أعلاه - المجاورة لكل حقل)

source: You have used {num_used} of {num_total} submissions
ar: لقد قمت باستعمال {num_used} من {num_total} مرات للتسليم

source: Email or password is incorrect.
ar: البريد الإلكتروني أو كلمة المرور غير صحيحة

source: Return To %s
ar: العودة إلى %s

source: Preferences for {platform_name}
ar: التفضيلات بالنسبة لمنصة {platform_name}

source: Update my {platform_name} Account
ar: تحديث حسابي على منصة {platform_name}

source: Welcome {username}! Please set your preferences below
ar: مرحباً {username}! الرجاء تحديد تفضيلاتك أدناه

source: We're sorry, {platform_name} enrollment is not available in your region
ar: للأسف التسجيل في {platform_name} غير متاح في منطقتك

source: The following errors occured while processing your registration:
ar: حدثت الأخطاء التالية أثناء إتمام عملية تسجيلك:

source: Required fields are noted by <strong class="indicator">bold text and an asterisk (*)</strong>.
ar: تم تحديد الحقول الإلزامية باستخدام <strong class="indicator">الحروف الغامقة وعلامة النجمة (*)</strong>.

source: Enter a public username:
ar: أدخل اسم مستخدم علني:

source: example: JaneDoe
ar: مثال: JaneDoe

source: Will be shown in any discussions or forums you participate in
ar: سيتم إظهاره في أية نقاشات أو منتديات تشارك بها

source: example: username@domain.com
ar: مثال: username@domain.com

source: Account Acknowledgements
ar: الإقرارات الخاصة بالحساب

source: I agree to the {link_start}Terms of Service{link_end}
ar: أوافق على {link_start} شروط الخدمة {link_end}

source: I agree to the {link_start}Honor Code{link_end}
ar: أوافق على {link_start}ميثاق الشرف {link_end}

source: Submit
ar: تقديم

source: Update My Account
ar: تحديث حسابي

source: Register for {platform_name}
ar: التسجيل في {platform_name}

source: Create my {platform_name} Account
ar: إنشاء حسابي في {platform_name}

source: Welcome!
ar: مرحباً!

source: Register below to create your {platform_name} account
ar: قم بالتسجيل أسفل لإنشاء حسابك على منصة {platform_name}

source: Please complete the following fields to register for an account.
ar: الرجاء إكمال الحقول التالية للتسجيل لحساب.

source: cannot be changed later
ar: لا يمكن تغييره لاحقاً

source: example: Jane Doe
ar: مثال: JaneDoe

source: Needed for any certificates you may earn
ar: مطلوب لأي شهادة يمكن أن تحصل عليها

source: Welcome {username}
ar: مرحباً {username}

source: Optional Personal Information
ar: معلومات شخصية اختيارية

source: Highest Level of Education Completed
ar: أعلى مستوى تعليمي تم استكماله

source: Gender
ar: الجنس

source: Year of Birth
ar: سنة الميلاد

source: Mailing Address
ar: العنوان البريدي

source: Please share with us your reasons for registering with {platform_name}
ar: الرجاء مشاركتنا الأسباب التي دفعتك للتسجيل مع {platform_name}

source: Register
ar: تسجيل

source: Create My Account
ar: إنشاء حسابي

source: Registration Help
ar: المساعدة الخاصة بعملية التسجيل

source: Already registered?
ar: مسجَل مسبقاً؟

source: Click here to log in.
ar: اضغط هنا لتسجيل الدخول.

source: Welcome to {platform_name}
ar: مرحباً بك في {platform_name}

source: Registering with {platform_name} gives you access to all of our current and future free courses. Not ready to take a course just yet? Registering puts you on our mailing list - we will update you as courses are added.
ar: يعطيك التسجيل مع {platform_name} صلاحية الدخول لجميع المقررات المجانية الحالية والمستقبلية لدينا. لست مستعداً بعد للتسجيل في مقرر؟ التسجيل معنا يضعك على قائمة المراسلات لدينا، سنقوم بإعلامك بالمقررات التي يتم إضافتها.

source: Next Steps
ar: الخطوات التالية

source: You will receive an activation email. You must click on the activation link to complete the process. Don't see the email? Check your spam folder and mark emails from class.stanford.edu as 'not spam', since you'll want to be able to receive email from your courses.
ar: ستصلك رسالة تفعيل إلكترونية. عليك الضغط على رابط التفعيل لاستكمال عملية التسجيل. إذا لم تجد هذه الرسالة، قم بالبحث في ملف الرسائل غير المرغوب بها، ثم حدّد الرسائل الواردة من class.stanford.edu على أنها ’ليست رسائل غير مرغوب بها‘ حتى تصلك الرسائل من مقرراتك مستقبلاً.

source: As part of joining {platform_name}, you will receive an activation email. You must click on the activation link to complete the process. Don't see the email? Check your spam folder and mark {platform_name} emails as 'not spam'. At {platform_name}, we communicate mostly through email.
ar: كجزءٍ من عملية الانضمام لـ {platform_name}، ستصلك رسالة تفعيل إلكترونية وسيتعين عليك الضغط على رابط التفعيل لإكمال العملية. إذا لم تجد هذه الرسالة، قم بالبحث في ملف الرسائل غير المرغوب بها، ثم حدّد الرسائل الواردة من {platform_name} على أنها ’ليست رسائل غير مرغوب بها‘، حيث أننا في {platform_name} نعتمد في معظم اتصالالتنا على رسائل البريد الالكتروني.

source: Need help in registering with {platform_name}?
ar: هل تحتاج إلى المساعدة للتسجيل في {platform_name}؟

source: View our FAQs for answers to commonly asked questions.
ar: قم بزيارة صفحة الأسئلة المتكررة لتجد الإجابات عن الأسئلة الأكثر شيوعاً.

source: Once registered, most questions can be answered in the course specific discussion forums or through the FAQs.
ar: لدى الانتهاء من التسجيل، يمكن أن تجد إجابةً لمعظم الأسئلة التي تود طرحها في منتديات النقاشات الخاصة بالمقرر أو في صفحات الأسئلة المتكررة.

source: Section Navigation
ar: تصفح القسم

source: Previous
ar: السابق

source: Next
ar: التالي

source: Sign Up for {span_start}{platform_name}{span_end}
ar: التسجيل في {span_start}{platform_name}{span_end}

source: E-mail *
ar: البريد الإلكتروني*

source: e.g. yourname@domain.com
ar: على سبيل المثال yourname@domain.com

source: Password *
ar: كلمة السر*

source: Public Username *
ar: اسم المستخدم العلني*

source: e.g. yourname (shown on forums)
ar: على سبيل المثال اسمك (كما سيظهر في المنتديات)

source: Full Name *
ar: الإسم الكامل*

source: e.g. Your Name (for certificates)
ar: على سبيل المثال اسمك الكامل (كما سيظهر على الشهادات)

source: <i>Welcome</i> {name}
ar: </i>مرحباً<i> {name}

source: Ed. Completed
ar: تم الانتهاء من التعديل

source: Year of birth
ar: سنة الميلاد

source: Mailing address
ar: العنوان البريدي

source: Goals in signing up for {platform_name}
ar: أهداف التسجيل في {platform_name}

source: I agree to the {link_start}Terms of Service{link_end}*
ar: أوافق على {link_start} شروط الخدمة {link_end}*

source: I agree to the {link_start}Honor Code{link_end}*
ar: أوافق على {link_start} ميثاق الشرف {link_end}*

source: Already have an account?
ar: لديك حساب مسبقاً؟

source: Login.
ar: تسجيل الدخول.

source: Staff Debug Info
ar: معلومات التصحيح للموظفين

source: Submission history
ar: تاريخ التسليم

source: {platform_name} Content Quality Assessment
ar: تقييم جودة محتوى {platform_name}

source: Comment
ar: التعليق

source: comment
ar: تعليق

source: Tag
ar: بطاقة تعريف

source: Optional tag (eg "done" or "broken"):&nbsp;
ar: بطاقة تعريف اختيارية (على سبيل المثال "تم إنجازه" أو "منقطع"):

source: tag
ar: بطاقة تعريف

source: Add comment
ar: أضف تعليق

source: Staff Debug
ar: تصحيح طاقم العمل

source: Module Fields
ar: حقول الوحدة الدراسية

source: XML attributes
ar: خصائص XML

source: Submission History Viewer
ar: عرض تاريخ عمليات التسليم

source: User:
ar: المستخدم:

source: View History
ar: استعراض التاريخ

source: {course_number} Textbook
ar: كتاب {course_number}

source: Textbook Navigation
ar: تصفح الكتاب

source: Page:
ar: الصفحة:

source: Zoom Out
ar: تصغير

source: Zoom In
ar: تكبير

source: Zoom
ar: مدى تكبير الصورة

source: Automatic Zoom
ar: تكبير الصورة آلياً

source: Actual Size
ar: الحجم الطبيعي

source: Fit Page
ar: التكبير بحجم الصفحة

source: Full Width
ar: العرض الكامل

source: Previous page
ar: الصفحة السابقة

source: Next page
ar: الصفحة التالية

source: Pearson VUE Test Center Proctoring - Registration
ar: التسجيل للمراقبة في مركز امتحان بيرسون VUE

source: Your Pearson VUE Proctored Exam Registration
ar: التسجيل لامتحانك المراقب في مركز امتحانات بيرسون VUE

source: Register for a Pearson VUE Proctored Exam
ar: تقديم طلب التسجيل في امتحان بيرسون VUE المراقب

source: Your registration for the Pearson exam has been processed
ar: جاري معالجة طلب تسجيلك في امتحان بيرسون

source: Your registration number is <strong>{reg_number}</strong>. (Write this down! You'll need it to schedule your exam.)
ar: رقم التسجيل الخاص بك هو <strong>{reg_number}</strong>. (قم بتدوين الرقم حيث ستحتاجه لتحديد موعد امتحانك.)

source: Schedule Pearson exam
ar: وضع جدول امتحان Pearson

source: Your demographic information contained an error and was rejected
ar: هنالك خطأ في معلوماتك الديموغرافية وقد تم رفضها

source: Please check the information you provided, and correct the errors noted below.
ar: الرجاء التأكد من المعلومات التي قمت بتقديمها، وتصحيح الأخطاء المبينة أدناه.

source: Your registration for the Pearson exam has been rejected
ar: لقد تم رفض طلب تسجيلك لامتحان بيرسون.

source: Please see your <strong>registration status</strong> details for more information.
ar: الرجاء الاطلاع على تفاصيل حالة التسجيل للحصول على مزيدٍ من المعلومات.

source: Your registration for the Pearson exam is pending
ar: تسجيلك في امتحان بيرسون معلق حالياً

source: Once your information is processed, it will be forwarded to Pearson and you will be able to schedule an exam.
ar: بمجرد الانتهاء من معالجة معلوماتك ستتم إعادة إرسالها إلى بيرسون ومن ثم سيكون باستطاعتك تحديد موعد امتحان.

source: Registration Form
ar: نموذج التسجيل

source: Registration for this Pearson exam is closed
ar: تم إغلاق التسجيل لامتحان بيرسون هذا

source: Your previous information is available below, however you may not edit any of the information.
ar: معلوماتك السابقة مبينة أدناه، إلا أنه ليس بإمكانك تعديل أي منها.

source: Please use the following form if you need to update your demographic information used in your Pearson VUE Proctored Exam. Required fields are noted by <strong class="indicator">bold text and an asterisk (*)
ar: الرجاء استعمال النموذج التالي في حال احتجت إلى تحديث معلوماتك الديموغرافية المستخدمة في امتحان بيرسون VUE المراقب. تم تحديد الحقول الإلزامية باستعمال <strong class="indicator">الحروف الغامقة وعلامة النجمة (*)

source: Please provide the following demographic information to register for a Pearson VUE Proctored Exam. Required fields are noted by <strong class="indicator">bold text and an asterisk (*)
ar: الرجاء إدخال المعلومات الديموغرافية التالية للتسجيل في امتحان بيرسون VUE المراقب. تم تحديد الحقول الإلزامية باستعمال <strong class="indicator">الحروف الغامقة وعلامة النجمة (*)

source: Personal Information
ar: معلومات شخصية

source: Salutation
ar: اللقب

source: e.g. Mr., Ms., Mrs., Dr.
ar: مثال السيد، السيدة، الآنسة، الدكتور

source: First Name
ar: الاسم الأول

source: e.g. Albert
ar: مثال آلبرت

source: Middle Name
ar: اسم الأب

source: Last Name
ar: الاسم الأخير

source: e.g. Einstein
ar: مثال آينشاين

source: Suffix
ar: اللواحق

source: e.g. Jr., Sr.
ar: مثال الأصغر، الأول، الثاني

source: Address Line #1
ar: العنوان، سطر #1

source: e.g. 112 Mercer Street
ar: مثال 112 شارع ميرسير

source: Address Line #2
ar: العنوان، سطر #2

source: e.g. Apartment 123
ar: مثال الشقة 123

source: Address Line #3
ar: العنوان، سطر #3

source: e.g. Attention: Albert Einstein
ar: مثال المرسل إليه: آلبرت آينشتاين

source: City
ar: المدينة

source: e.g. Newark
ar: مثال نيووارك

source: State/Province
ar: الولاية/المقاطعة

source: e.g. NJ
ar: مثال نيوجيرسي

source: Postal Code
ar: الرمز البريدي

source: e.g. 08540
ar: مثال 08540

source: Country Code
ar: رمز الدولة

source: e.g. USA
ar: مثال USA

source: Contact &amp; Other Information
ar: معلومات الاتصال والمعلومات الأخرى

source: Phone Number
ar: رقم الهاتف

source: Extension
ar: الرقم الفرعي

source: Phone Country Code
ar: رمز الهاتف الدولي

source: Fax Number
ar: رقم الفاكس

source: Fax Country Code
ar: رمز الفاكس الدولي

source: Company
ar: الشركة

source: e.g. American Association of University Professors
ar: مثال الرابطة الأمريكية لأساتذة الجامعات

source: <span class="title">Note</span>: Your previous accommodation request below needs to be reviewed in detail <strong>and will add a significant delay to your registration process</strong>.
ar: <span class="title">ملاحظة</span>: إن طلبك السابق للسكن والمبين أدناه بحاجة للمراجعة بشكلٍ مفصل، <strong>وسيؤدي إلى تأخير كبير في عملية التسجيل الخاصة بك</strong>.

source: <span class="title">Note</span>: Accommodation requests are not part of your demographic information, <strong>and cannot be changed once submitted</strong>. Accommodation requests, which are reviewed on a case-by-case basis, <strong>will add significant delay to the registration process</strong>.
ar: <span class="title">ملاحظة</span>: إن طلبات السكن ليست جزءاً من معلوماتك الديموغرافية، <strong>ولا يمكن تغييرها بمجرد تقديمها</strong>. كما أن طلبات السكن، التي تتم مراجعتها كلٌّ على حدة، <strong>ستؤدي إلى تأخير كبير في عملية التسجيل</strong>.

source: Optional Information
ar: معلومات اختيارية

source: Accommodations Requested
ar: طلبات السكن

source: Update Demographics
ar: تحديث المعلومات الديموغرافية

source: Cancel Update
ar: إلغاء التحديث

source: Register for Pearson VUE Test
ar: التسجيل لامتحان بيرسون VUE

source: Cancel Registration
ar: إلغاء التسجيل

source: Special (<abbr title="Americans with Disabilities Act">ADA</abbr>) Accommodations
ar: السكن الخاص (<abbr title="Americans with Disabilities Act">القانون الخاص بالأمريكيين من ذوي الإعاقات</abbr>)

source: Pearson Exam Registration Status
ar: حالة التسجيل لامتحان بيرسون

source: Demographic Information
ar: معلومات ديموغرافية

source: The demographic information you most recently provided is pending. You may edit this information at any point before exam registration closes on <strong>{end_date}</strong>
ar: المعلومات الديموغرافية التي قمت بتقديمها مؤخراً معلّقة حالياً، وبإمكانك إجراء تعديلاتٍ عليها في أي وقت قبل انتهاء موعد التسجيل للامتحان بتاريخ <strong>{end_date}</strong>

source: The demographic information you most recently provided has been processed. You may edit this information at any point before exam registration closes on <strong>{end_date}</strong>
ar: تم الانتهاء من معالجة المعلومات الديموغرافية التي قمت بتقديمها مؤخراً، وبإمكانك إجراء تعديلاتٍ عليها في أي وقت قبل انتهاء موعد التسجيل للامتحان بتاريخ <strong>{end_date}</strong>

source: The demographic information you most recently provided has been rejected by Pearson. You can correct and submit it again before the exam registration closes on <strong>{end_date}</strong>. The error message is:
ar: المعلومات الديموغرافية التي قدَمتها مؤخراً تم رفضها من قبل بيرسون. بإمكانك تصحيحها وإعادة تقديمها مرةً أخرى قبل إغلاق أبواب التسجيل للامتحان في <strong>{end_date}</strong>. الرسالة الخصة بالخطأ هي:

source: If the error is not correctable by revising your demographic information, please {contact_link_start}contact edX at exam-help@edx.org{contact_link_end}.
ar: إذا كان الخطأ غير قابل للتصحيح بمراجعة معلوماتك الديمغرافية، الرجاء {contact_link_start} الاتصال مع edx على العنوان البريدي exam-help@edx.org {contact_link_end}.

source: Accommodations Request
ar: طلب السكن

source: Your requested accommodations are pending. Within a few days, you should see confirmation here of granted accommodations.
ar: إن طلبات السكن التي تقدّمت بها ما تزال معلّقة، وسيكون بإمكانك في غضون أيامٍ قليلة أن ترى هنا معلومات تأكيد بخصوص السكن الممنوح.

source: Your requested accommodations have been reviewed and processed. You are allowed:
ar: تمت مراجعة ومعالجة طلبات السكن التي تقدّمت بها، وتمت الموافقة:

source: Your requested accommodations have been reviewed and processed. You are allowed no accommodations.
ar: تمت مراجعة ومعالجة طلبات السكن التي تقدّمت بها، ولم يتم الموافقةعلى منحك أي سكن.

source: Please {contact_link_start}contact {edX} at ${exam_help}{contact_link_end}.
ar: الرجاء التواصل مع {contact_link_start}contact {edX} at ${exam_help}{contact_link_end}.

source: Registration Request
ar: طلب التسجيل

source: Your exam registration is pending. Once your information is processed, it will be forwarded to Pearson and you will be able to schedule an exam.
ar: طلب التسجيل الخاص بك في الامتحان ما يزال معلَقاً. بمجرد الانتهاء من معالجة معلوماتك سيتم إعادة إرسالها إلى بيرسون وسيكون باستطاعتك وضع موعد للامتحان.

source: Your exam registration has been processed and has been forwarded to Pearson. <strong>You are now able to {exam_link_start}schedule a Pearson exam{exam_link_end}</strong>.
ar: تمت معالجة طلب التسجيل الخاص بك في الامتحان، كما تمت إعادة إرسالها إلى بيرسون. <strong>بإمكانك الآن {exam_link_start}تحديد موعد لامتحان بيرسون{exam_link_end}</strong>.

source: Your exam registration has been rejected by Pearson. <strong>You currently cannot schedule an exam</strong>. The errors found include:
ar: تمت رفض طلب التسجيل الخاص بك في الامتحان من قبل بيرسون. <strong>ليس بإمكانك حالياً تحديد موعد للامتحان </strong>.

source: Please {contact_link_start}contact edX at exam-help@edx.org{contact_link_end}.
ar: الرجاء {contact_link_start}التواصل مع edX على عنوان البريد الإلكتروني exam-help@edx.org{contact_link_end}.

source: About {university} {course_number}
ar: نبذة عن {university} {course_number}

source: Course Completed:
ar: المقرر المستكمل:

source: Course Started:
ar: المقرر الذي تم البدء به:

source: Course Starts:
ar: تاريخ ابتداء المقرر:

source: Pearson VUE Test Details
ar: تفاصيل امتحان بيرسون VUE

source: Exam Name:
ar: اسم الامتحان:

source: First Eligible Appointment Date:
ar: تاريخ أول موعد ملائم:

source: Last Eligible Appointment Date:
ar: تاريخ آخر موعد ملائم:

source: Registration Ends:
ar: تاريخ انتهاء التسجيل:

source: Questions
ar: الأسئلة

source: If you have a specific question pertaining to your registration, you may {contact_link_start}contact edX at exam-help@edx.org{contact_link_end}.
ar: في حال كان لديك سؤال معين يتعلق بالتسجيل الخاص بك، بإمكانك {contact_link_start}التواصل مع edX على البريد الإلكترونيexam-help@edx.org{contact_link_end}.

source: Tracking Log
ar: سجل التتبع

source: datetime
ar: التاريخ والموعد

source: username
ar: اسم المستخدم

source: ipaddr
ar: عنوان بروتوكول الإنترنت

source: source
ar: المصدر

source: type
ar: النوع

source: Using the system
ar: استخدام النظام

source: During video playback, use the subtitles and the scroll bar to navigate. Clicking the subtitles is a fast way to skip forwards and backwards by small amounts.
ar: أثناء عرض مقاطع الفيديو، قم باستخدام العناوين الفرعية وشريط التمرير للانتقال. استخدام العناوين الفرعية هو طريقة سريعة للانتقال للأمام أو للخلف في الفيديو بمسافاتٍ قليلة.

source: If you are on a low-resolution display, the left navigation bar can be hidden by clicking on the set of three left arrows next to it.
ar: إذا كانت شاشتك ذات دقة منخفضة، يمكن إخفاء شريط التنقل الموجود على اليسار من خلال النقر على مجموعة الأسهم الثلاثة اليسرى بجانبه.

source: If you need bigger or smaller fonts, use your browsers settings to scale them up or down. Under Google Chrome, this is done by pressing ctrl-plus, or ctrl-minus at the same time.
ar: إذا كنت بحاجةٍ إلى أنواع خط أكبر أو أصغر، قم باستعمال إعدادات متصفح الانترنت الخاص بك لزيادة أو تخفيض أحجامهم. في Google Chrome تستطيع أن تفعل ذلك من خلال الضغط على ctrl-plus أو ctrl-minus في نفس الوقت.

source: ERROR: No playable video sources found!
ar: خطأ: لم يتم إيجاد مصادر قابلة للتشغيل من تسجيلات الفيديو!

source: Play
ar: تشغيل

source: Speeds
ar: السرعات

source: Speed
ar: السرعة

source: Volume
ar: الصوت

source: Fill browser
ar: إدخال اسم المتصفح

source: HD
ar: جودة عالية

source: Turn off captions
ar: إيقاف العناوين الفرعية
