Repository: a-nassif/edraak
Catalog: conf/locale/*/LC_MESSAGES/mako.po
Languages: ar

source: Your request did not meet the criteria/guidelines specified by edX Staff.
ar: لم يستوف طلبك المعايير/الإرشادات المحددة من قبل طاقم edX.

source: edX Studio is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by edX. Our team is currently evaluating your request.
ar: EDX استوديو هو حل برمجي مستضاف نوفّره لشركاء xConsortium وللضيوف المحددين. تظهر المقررات التي كنت عضواً في فريق إنشائها في الأعلى وبإمكانك تعديلها، في الأثناء التي يتم خلالها منح امتيازات صاحب المقرر من قبل EDX. طلبك قيد التقييم الآن من قبل فريقنا.

source: Pending
ar: معلّق

source: Your request is currently being reviewed by edX staff and should be updated shortly.
ar: طلبك حالياً قيد المراجعة والتقييم من قبل طاقم edX في الوقت الحالي وسيتم التحديث بشأنه قريباً.

source: Need help?
ar: هل تحتاج إلى مساعدة؟

source: If you are new to Studio and having trouble getting started, there are a few things that may be of help:
ar: إذا كنت جديداً على برنامج استوديو ولديك بعض الصعوبات في البدء، هنالك بعض الأمور التي قد تساعدك:

source: Get started by reading Studio's Documentation
ar: ابدأ أولاً بقراءة التوثيق الخاص ببرنامج استوديو.

source: Request help with Studio
ar: اطلب المساعدة ببرنامج استوديو

source: Can I create courses in Studio?
ar: هل أستطيع إنشاء مقررات باستخدام برنامج استوديو؟

source: In order to create courses in Studio, you must
ar: حتى تتمكن من إنشاء مقرراتٍ في برنامج استوديو، عليك أن

source: contact edX staff to help you create a course
ar: اتصل بطاقم edX لمساعدتك في إنشاء مقرر

source: In order to create courses in Studio, you must have course creator privileges to create your own course.
ar: كي تتمكن من إنشاء مقرراتٍ في برنامج استوديو، يجب أن تكون لديك صلاحيات صاحب المقرر لإنشاء مقررك.

source: Your request to author courses in studio has been denied. Please
ar: الطلب الذي تقدمت به لتأليف المقررات في الاستوديو قد رفض. الرجاء

source: contact edX Staff with further questions
ar: اتصل بطاقم edX في حال كانت لديك أية أسئلة إضافية

source: Thanks for signing up, %(name)s!
ar: نشكرك على تسجيل اشتراكك، %(name)s!

source: We need to verify your email address
ar: علينا التحقق من عنوان بريدك الإلكتروني

source: Almost there! In order to complete your sign up we need you to verify your email address (%(email)s). An activation message and next steps should be waiting for you there.
ar: أوشكت على الانتهاء من تقديم الطلب! من أجل استكمال الطلب يجب عليك تأكيد بريدك الإلكتروني (%(email)s). ستجد رسالة التفعيل مع الخطوات القادمة التي يجب اتخاذها بانتظارك هناك.

source: Please check your Junk or Spam folders in case our email isn't in your INBOX. Still can't find the verification email? Request help via the link below.
ar: الرجاء التحقق من ملف الرسائل غير المرغوب بها في حال عدم وجود الرسالة في ملف البريد الوارد. وإذا لم تتمكن من إيجاد رسالة التأكيد؟ اطلب المساعدة عن طريق الرابط في الأسفل.

source: Sign In
ar: تسجيل الدخول

source: Sign In to edX Studio
ar: تسجيل الدخول لاستوديو edX

source: Don't have a Studio Account? Sign up!
ar: لا يوجد لديك حساب استوديو؟ قم بالتسجيل!

source: Required Information to Sign In to edX Studio
ar: المعلومات المطلوبة لتسجيل الدخول لاستوديو edX

source: Email Address
ar: عنوان البريد الإلكتروني

source: Forgot password?
ar: نسيت كلمة السر؟

source: Password
ar: كلمة السر

source: Studio Support
ar: دعم الاستوديو

source: Need Help?
ar: هل تحتاج مساعدة؟

source: Having trouble with your account? Use {link_start}our support center{link_end} to look over self help steps, find solutions others have found to the same problem, or let us know of your issue.
ar: هل تواجه مشكلة بالنسبة لحسابك؟ استعمل {link_start} مركز الدعم الخاص بنا {link_end} للاطلاع على بعض خطوات المساعدة الذاتية، وقم بإيجاد الحلول التي وجدها الآخرون لنفس المشكلة، أو أعلمنا بمشكلتك.

source: Course Team Settings
ar: إعدادات فريق المقرر

source: Course Team
ar: فريق المقرّر

source: New Team Member
ar: عضو جديد بالفريق

source: Add a User to Your Course's Team
ar: أضف مستخدم إلى فريق المقرر الخاص بك

source: New Team Member Information
ar: المعلومات الخاصة بالعضو الجديد في الفريق

source: User's Email Address
ar: عنوان البريد الإلكتروني الخاص بالمستخدم

source: e.g. jane.doe@gmail.com
ar: مثال jane.doe@gmail.com

source: Please provide the email address of the course staff member you'd like to add
ar: الرجاء تزويدنا بالعنوان الإلكتروني لعضو طاقم المقرر الذي تود إضافته

source: Add User
ar: إضافة مستخدم

source: Current Role:
ar: الدور الحالي:

source: Admin
ar: مشرف

source: You!
ar: أنت!

source: Staff
ar: طاقم

source: send an email message to {email}
ar: أرسل رسالة إلكترونية إلى {email}

source: Promote another member to Admin to remove your admin rights
ar: قم بترفيع عضوٍ آخر إلى درجة مشرف حتى تتمكن من إزالة حقوق المشرف الخاصة بك

source: Remove Admin Access
ar: إزالة صلاحية الوصول الخاصة بالمشرف

source: Add Admin Access
ar: إضافة صلاحية الوصول الخاصة بالمشرف

source: Delete the user, {username}
ar: حذف المستخدم، {username}

source: Add Team Members to This Course
ar: أضف أعضاء آخرين لفريق هذا المقرر

source: Adding team members makes course authoring collaborative. Users must be signed up for Studio and have an active account.
ar: إضافة أعضاء للفريق يجعل من تأليف المقرر نشاطاً تعاونياً. يجب على المستخدمين التسجيل في الاستوديو و تفعيل حساباتهم.

source: Add a New Team Member
ar: إضافة عضو جديد للفريق

source: About Roles within Your Course Team
ar: ما يتعلق بالأدوار ضمن فريق مقررك

source: Course team members are co-authors (staff). They have full access to all the content in the course and all the same editing privileges. Admins have the unique ability to add and remove course team members.
ar: أعضاء فريق المقرر هم مشاركون في التأليف (طاقم)، ولديهم كامل الصلاحية للوصول إلى كافة محتوى المقرر وكذلك جميع صلاحيات التعديل ذاتها. المشرفون وحدهم من لديهم القدرة على إضافة وإزالة أعضاء من فريق المقرر.

source: Tranferring Ownership
ar: نقل الملكية

source: There must always be an Admin assigned to every course. To transfer your ownership of the course, add Admin access to another user and request they remove you from the Course Team list.
ar: لابد دائماً من تعيين مشرف لكل واحدٍ من المقررات. ولنقل ملكيتك للمقرر، يجب أن تضيف صلاحية المشرف لمستخدمٍ آخر وأن تطلب إزالتك من قائمة فريق المقرر.

source: Course Outline
ar: المخطّط الطلي للمقرر

source: Collapse/expand this section
ar: تصغير/تكبير هذا القسم

source: New Section Name
ar: اسم القسم الجديد

source: Delete this section
ar: حذف هذا القسم

source: Drag to re-order
ar: السحب لإعادة الترتيب

source: New Subsection
ar: قسم فرعي جديد

source: New Unit
ar: وحدة جديدة

source: Collapse All Sections
ar: تصغير كافّة الأقسام

source: New Section
ar: قسم جديد

source: Expand/collapse this section
ar: تكبير/تصغير هذا القسم

source: This section has not been released.
ar: لم يتم إصدار هذا القسم

source: Schedule
ar: وضع الجدول

source: Will Release:
ar: سيتم النشر:

source: Expand/collapse this subsection
ar: تكبير/تصغير هذا القسم الفرعي

source: Delete this subsection
ar: حذف هذا القسم الفرعي

source: Section Release Date
ar: تاريخ إصدار القسم

source: On the date set above, this section - {name} - will be released to students. Any units marked private will only be visible to admins.
ar: سيتم إصدار هذا القسم - {name} - للطلاّب في التاريخ المحدد أعلاه . وأية وحدات مصنفة على أنها "خاصَة" ستكون مرئية فقط للمشرفين.

source: Schedule &amp; Details Settings
ar: إعدادات الجدول والتفاصيل

source: Schedule & Details
ar: الجدول والتفاصيل

source: Basic Information
ar: معلومات أساسية

source: The nuts and bolts of your course
ar: العناصر والأدوات الخاصة اللازمة لمقررك

source: This field is disabled: this information cannot be changed.
ar: هذا الحقل غير مفعَل: لا يمكن تغيير هذه المعلومة.

source: Course Summary Page
ar: صفحة الملخص الخاص بالمقرر

source: (for student enrollment and access)
ar: (لتسجيل ودخول الطلاب)

source: Send a note to students via email
ar: إرسال ملاحظة للطلاب عن طريق البريد الإلكتروني

source: Invite your students
ar: قم بدعوة طلابك

source: Promoting Your Course with edX
ar: الترويج لمقرّرك باستخدام edX

source: Your course summary page will not be viewable until your course has been announced. To provide content for the page and preview it, follow the instructions provided by your <abbr title="Program Manager">PM</abbr> or Conrad Warre <a rel="email" class="action action-email" href="mailto:conrad@edx.org">(conrad@edx.org)</a>.
ar: لا يمكن رؤية صفحة ملخص مقرّرك إلا بعد الإعلان عنه. ولتوفير محتوى للصفحة ومعاينتها بشكلها النهائي، اتبع الإرشادات المتوفرة من قبل مدير البرنامج أو السيد كونراد وير على <a rel="email" class="action action-email" href="mailto:conrad@edx.org">(conrad@edx.org)</a>.

source: Course Schedule
ar: جدول المقرر

source: Dates that control when your course can be viewed.
ar: التواريخ التي تتحكم بتوقيت رؤية مقررك.

source: Course Start Date
ar: تاريخ بدء المقرر

source: First day the course begins
ar: اليوم الأول الذي يبتدئ فيه المقرر

source: Course Start Time
ar: وقت بدء المقرر

source: Course End Date
ar: تاريخ انتهاء المساق

source: Last day your course is active
ar: اليوم الأخير الذي يبقى فيه المقرر مفعّلاً

source: Course End Time
ar: وقت انتهاء المقرر

source: Enrollment Start Date
ar: تاريخ بدء التسجيل

source: First day students can enroll
ar: اليوم الأول المتاح للطلاب للتسجيل

source: Enrollment Start Time
ar: وقت ابتداء التسجيل

source: Enrollment End Date
ar: تاريخ انتهاء التسجيل

source: Last day students can enroll
ar: آخر يومٍ متاحٍ للطلاب للتسجيل

source: Enrollment End Time
ar: وقت انتهاء التسجيل

source: These Dates Are Not Used When Promoting Your Course
ar: لا يتم استعمال هذه التواريخ عند الترويج لمقررك

source: These dates impact <strong>when your courseware can be viewed</strong>, but they are <strong>not the dates shown on your course summary page</strong>. To provide the course start and registration dates as shown on your course summary page, follow the instructions provided by your <abbr title="Program Manager">PM</abbr> or Conrad Warre <a rel="email" class="action action-email" href="mailto:conrad@edx.org">(conrad@edx.org)</a>.
ar: تؤثر هذه التواريخ على <strong>الفترة التي يمكن فيها رؤية المنهاج</strong>، لكنها <strong>تختلف عن التواريخ التي تظهر على صفحة ملخص مقررك</strong>. ولتحديد تاريخ بدء المقرر وتواريخ التسجيل كما ستظهر على صفحة ملخص مقررك، الرجاء اتباع الإرشادات المتوفرة من قبل مدير البرنامج أو السيد كونراد وار على <a rel="email" class="action action-email" href="mailto:conrad@edx.org">(conrad@edx.org)</a>.

source: Introducing Your Course
ar: تقديم المقرر الخاص بك

source: Information for prospective students
ar: معلومات للطلبة المحتملين

source: Course Overview
ar: نبذة عامة عن المقرر

source: your course summary page
ar: صفحة ملخص المقرر

source: Introductions, prerequisites, FAQs that are used on %s (formatted in HTML)
ar: المقدّمات، والمتطلبات الأساسية، والأسئلة المتكررة المستخدمة حول النسب %s (منسّقة بلغة HTML)

source: Course Image
ar: صورة المقرر

source: You can manage this image along with all of your other
ar: تستطيع التحكم بهذه الصورة إلى جانب باقي الصور الخاصة بك

source: files &amp; uploads
ar: الملفات والتحميلات

source: Your course currently does not have an image. Please upload one (JPEG or PNG format, and minimum suggested dimensions are 375px wide by 200px tall)
ar: مقررك لا يتضمن صورة حالياً. الرجاء تحميل صورة (بصيغة JPEG أو PNG، بأبعاد مقترحة لا تقل عن 375px عرضاً و 200px طولاً)

source: Please provide a valid path and name to your course image (Note: only JPEG or PNG format supported)
ar: الرجاء إعطاء عنوان مسار وتسمية صحيحين لصورة المقرر (ملاحظة: الصور بصيغة JPEG أو PNG هي فقط المدعومة)

source: Upload Course Image
ar: تحميل صورة المقرر

source: Course Introduction Video
ar: مقطع الفيديو الخاص بتقديم المقرر

source: Delete Current Video
ar: حذف الفيديو الحالي

source: Enter your YouTube video's ID (along with any restriction parameters)
ar: أدخل رقم التعريف لمقطع فيديو اليوتيوب الخاص بك (إلى جانب أي معاملات تقييد)

source: Requirements
ar: المتطلبات

source: Expectations of the students taking this course
ar: توقعات الطلاب الذين قاموا بالتسجيل لأخذ هذا المقرر

source: Hours of Effort per Week
ar: ساعات الجهد المبذول لكل أسبوع

source: Time spent on all course work
ar: الوقت المبذول على كامل المقرر

source: How will these settings be used?
ar: كيف سيتم استخدام هذه الإعدادات؟

source: Your course's schedule settings determine when students can enroll in and begin a course.
ar: تحدد إعدادات جدول المقرر الخاص بك متى يمكن للطلاب التسجيل في مقررٍ معيّن ووقت بدء ذلك المقرر.

source: Additionally, details provided on this page are also used in edX's catalog of courses, which new and returning students use to choose new courses to study.
ar: بالإضافة إلى ذلك، فإن التفاصيل الموفرة على هذه الصفحة مستخدمة كذلك في كاتالوج edX للمقررات، الذي يستعمله الطلاب الجدد والطلاب السابقين لاختيار المقررات الجديدة التي سيقومون بدراستها.

source: Other Course Settings
ar: إعدادات أخرى للمقرر

source: Grading
ar: التقييم

source: Advanced Settings
ar: إعدادات متقدمة

source: Your policy changes have been saved.
ar: تم حفظ التغييرات على السياسة الخاصة بك.

source: There was an error saving your information. Please see below.
ar: حدث خطأ لدى القيام بحفظ معلوماتك كما هو مبين أدناه.

source: Manual Policy Definition
ar: تعريف السياسة اليدوية

source: Manually Edit Course Policy Values (JSON Key / Value pairs)
ar: قم بإجراء تعديلٍ يدوي على قيم سياسة المقرر (JSON Key / Value pairs)

source: <strong>Warning</strong>: Do not modify these policies unless you are familiar with their purpose.
ar: <strong> تحذير </strong>: لا تقم بتعديل هذه السياسات إلا إذا كنت على معرفة جيدة بأغراضها.

source: Manual policies are JSON-based key and value pairs that give you control over specific course settings that edX Studio will use when displaying and running your course.
ar: السياسات اليدوية هي JSON-based key and value pairs تعطيك القدرة على التحكم بإعدادات معينة للمقرر والتي سيستعملها استوديو edX عند عرض و تشغيل المقرر الخاص بك.

source: Any policies you modify here will override any other information you've defined elsewhere in Studio. With this in mind, please be very careful and do not edit policies that you are unfamiliar with (both their purpose and their syntax)
ar: ستحل أية سياسات تقوم بتعديلها هنا محل أية معلومات أخرى كنت قد عرَفتها في مكانٍ آخر في الاستوديو. لذا نرجو أن تكون حذراً للغاية ولا تقوم بتعديل السياسات التي لست على اطلاع جيّدٍ بها (بهدفها وقواعد كتابتها)

source: Details &amp; Schedule
ar: التفاصيل &amp; والجدول

source: Schedule and details
ar: الجدول والتفاصيل

source: Faculty
ar: الكلية

source: Faculty Members
ar: أعضاء هيئة التدريس

source: Individuals instructing and helping with this course
ar: الأشخاص الذين يقومون بالإرشاد والمساعدة في هذا المقرر

source: Faculty First Name:
ar: الاسم الأول لعضو هيئة التدريس:

source: Faculty Last Name:
ar: الاسم الأخير لعضو هيئة التدريس:

source: Faculty Photo
ar: صورة عضو هيئة التدريس

source: Delete Faculty Photo
ar: حذف صورة عضو هيئة التدريس

source: Faculty Bio:
ar: السيرة الذاتية لعضو هيئة التدريس:

source: A brief description of your education, experience, and expertise
ar: شرح مختصر عن دراستك، وتجاربك وخبراتك العملية

source: Delete Faculty Member
ar: حذف عضو هيئة التدريس

source: Upload Faculty Photo
ar: تحميل صورة عضو هيئة التدريس

source: Max size: 30KB
ar: أقصى حجم: 30KB

source: New Faculty Member
ar: عضو جديد في هيئة التدريس

source: Problems
ar: المسائل

source: General Settings
ar: الإعدادات العامة

source: Course-wide settings for all problems
ar: إعدادات على نطاق المقرر ككل لكافة المسائل

source: Problem Randomization:
ar: التنويع العشوائي للمسائل:

source: Always
ar: دائماً

source: <strong>randomize all</strong> problems
ar: <strong> نوّع عشوائياً جميع </strong> المسائل

source: Never
ar: أبداً

source: <strong>do not randomize</strong> problems
ar: <strong> لا تقوم بالتنويع العشوائي </strong> للمسائل

source: Per Student
ar: لكل طالب

source: randomize problems <strong>per student</strong>
ar: نوّع المسائل عشوائياً <strong> لكل طالب</strong>

source: Show Answers:
ar: أظهر الإجابات:

source: Answers will be shown after the number of attempts has been met
ar: سيتم إظهار الإجابات بعد اكتمال العدد المطلوب من المحاولات

source: Answers will never be shown, regardless of attempts
ar: لن يتم إظهار الإجابات أبداً، بغض النظر عن عدد المحاولات

source: Number of Attempts <br /> Allowed on Problems:
ar: عدد المحاولات <br /> المسموح لحل المسائل:

source: Students will this have this number of chances to answer a problem. To set infinite atttempts, use "0"
ar: سيكون لدى الطلاب هذا العدد من الفرص لإجابة المسألة. للسماح بعدد غير محدود من المحاولات استعمل "0"

source: Assignment Type Name
ar: اسم نوع الواجب المفروض

source: Number of Attempts <br /> Allowed on Problems:
ar: عدد المحاولات <br /> المسموحة للمسائل:

source: 0 or higher
ar: 0 أو أعلى

source: Discussions
ar: مناقشات

source: Course-wide settings for online discussion
ar: إعدادات على نطاق المقرر بأكمله للنقاشات المباشرة عبر الإنترنت

source: Anonymous Discussions:
ar: نقاشات دون كشف الهوية:

source: Allow
ar: السماح

source: Students and faculty <strong>will be able to post anonymously</strong>
ar: الطلاب وأعضاء هيئة التدريس <strong> سيكون بإمكانهم النشر دون الكشف عن هويتهم</strong>

source: Do Not Allow
ar: لا تسمح

source: Do not allow
ar: لا تسمح

source: <strong>Posting anonymously is not allowed</strong>. Any previous anonymous posts <strong>will be reverted to non-anonymous</strong>
ar: <strong> لا يسمح بالنشر باسم مجهول</strong>. وأية منشورات سابقة باسم مجهول <strong> سيتم إعادتها لتصبح باسم معلوم الهوية</strong>

source: This option is disabled since there are previous discussions that are anonymous.
ar: هذا الخيار غير مفعل نظراً لوجود نقاشات سابقة مجهولة الهوية.

source: Discussion Categories
ar: فئات النقاشات

source: Category Name:
ar: اسم الفئة:

source: General
ar: عام

source: Troubleshooting
ar: اكتشاف الخطأ وإصلاحه

source: Study Groups
ar: مجموعات الدراسة

source: Delete Category
ar: حذف الفئة

source: Lectures
ar: المحاضرات

source: Labs
ar: المختبرات

source: New Discussion Category
ar: فئة نقاش جديدة

source: Grading Settings
ar: إعدادات التقييم

source: Overall Grade Range
ar: النطاق العام للدرجات

source: Your overall grading scale for student final grades
ar: مقياس التقييم العام الخاص بك لعلامات الطلاب النهائية

source: Grading Rules &amp; Policies
ar: قواعد وسياسات التقييم

source: Deadlines, requirements, and logistics around grading student work
ar: المواعيد النهائية، المتطلبات، والشؤون اللوجستية المتعلقة بتقييم عمل الطالب

source: Grace Period on Deadline:
ar: فترة السماح على الموعد النهائي:

source: Leeway on due dates
ar: التأخر عن تواريخ الاستحقاق

source: Assignment Types
ar: أنواع الواجبات

source: Categories and labels for any exercises that are gradable
ar: الفئات والعناوين لأي من التمارين القابلة للتقييم

source: New Assignment Type
ar: نوع الواجب المطلوب الجديد

source: Your grading settings will be used to calculate students grades and performance.
ar: إعدادات التقييم الخاصة بك سيتم استعمالها في حساب درجات الطلاب وأدائهم

source: Overall grade range will be used in students' final grades, which are calculated by the weighting you determine for each custom assignment type.
ar: سيتم استعمال النطاق الكلي للدرجات في الدرجات النهائية للطلاب، والتي يتم حسابها على أساس الترجيح الذي اعتمدته لكل نوع مُعدَّل من أنواع الواجبات المفروضة.

source: Sign Up
ar: التسجيل

source: Sign Up for edX Studio
ar: التسجيل في استوديو edX

source: Already have a Studio Account? Sign in
ar: لديك حساب استوديو بالفعل؟ قم بتسجيل الدخول

source: Ready to start creating online courses? Sign up below and start creating your first edX course today.
ar: هل أنت جاهز لبدء إعداد مقررات الدورات المقامة على الإنترنت؟ قم بالتسجيل في الأسفل وابدأ اليوم بوضع أول مقرر edX لك .

source: Required Information to Sign Up for edX Studio
ar: المعلومات المطلوبة لتسجيل الدخول لاستوديو edX

source: Public Username
ar: اسم المستخدم العلني

source: This will be used in public discussions with your courses and in our edX101 support forums
ar: سيتم استعمال هذا الاسم في النقاشات العلنية المتعلقة بمقرراتك ومنتديات دعم edX101 الخاصة بنا.

source: Full Name
ar: الإسم الكامل

source: Your Location
ar: موقعك

source: Preferred Language
ar: اللغة المفضلة

source: I agree to the Terms of Service
ar: أوافق على شروط الخدمة

source: Create My Account &amp; Start Authoring Courses
ar: قم بإنشاء حسابي و ابدأ بتأليف المقررات

source: Common Studio Questions
ar: الأسئلة الشائعة الخاصة باستوديو

source: Who is Studio for?
ar: من يعنيه برنامج استوديو؟

source: Studio is for anyone that wants to create online courses that leverage the global edX platform. Our users are often faculty members, teaching assistants and course staff, and members of instructional technology groups.
ar: برنامج استوديو مخصّص لأي شخص يريد تأسيس مقررات تتم دراستها عبر الإنترنت والتي تقوي بدورها منصة edX العالمية. مستخدمينا هم في الغالب أعضاء هيئة التدريس، مساعدي المدرّسين والموظفين العاملين على المقرر، وأعضاء من مجموعات تقنيات التعليم.

source: How technically savvy do I need to be to create courses in Studio?
ar: كم يلزم من المعرفة والقدرة التكنولوجية حتى يكون الشخص قادراً على وضع مقررات باستخدام الاستوديو؟

source: Studio is designed to be easy to use by almost anyone familiar with common web-based authoring environments (Wordpress, Moodle, etc.). No programming knowledge is required, but for some of the more advanced features, a technical background would be helpful. As always, we are here to help, so don't hesitate to dive right in.
ar: برنامج الاستوديو مصمم ليكون سهل الاستعمال تقريباً من قبل أي شخص على معرفة بالواجهات العامة للتأليف باستخدام الإنترنت (.Wordpress, Moodle, etc). وليس هناك من ضرورة لوجود معرفة بأصول ولغات البرمجة، إلا أنه سيكون من المفيد امتلاك المستخدم لبعض الخلفية التكنولوجية بالنسبة لبعض الميزات المتقدمة. وكما هو الحال فنحن موجودون هنا دائماً للمساعدة بشكلٍ متواصل، لذا لا تتردد في البدء الآن.

source: I've never authored a course online before. Is there help?
ar: لم يسبق لي أن ألفت مقرراً على الإنترنت مسبقاً، هل هنالك طريقة للمساعدة؟

source: Absolutely. We have created an online course, edX101, that describes some best practices: from filming video, creating exercises, to the basics of running an online course. Additionally, we're always here to help, just drop us a note.
ar: بالطبع. فقد قمنا بإنشاء مقررٍ على الإنترنت باسم edX101 يعطي شرحاً لأفضل الممارسات: من تصوير مقاطع الفيديو، ووضع المسائل والتمارين، إلى أساسيات إدارة مقررٍ على الانترنت. وبالإضافة إلى ذلك كله فنحن موجودون دائماً للمساعدة، كل ما يلزم هو أن ترسل لنا ملاحظاتك أو أسئلتك.

source: New Static Page
ar: صفحة محتوى ثابت جديدة

source: Course Info
ar: معلومات المقرر

source: Textbook
ar: الكتاب

source: Syllabus
ar: مخطط المنهاج الدراسي

source: Textbooks
ar: الكتب

source: New Textbook
ar: كتاب جديد

source: Why should I break my text into chapters?
ar: لماذا يتعين تقسيم النص إلى فصول؟

source: It's best practice to break your course's textbook into multiple chapters to reduce loading times for students. Breaking up textbooks into chapters can also help students more easily find topic-based information.
ar: من الممارسات المفضلة القيام بتقسيم كتاب المقرر إلى عدة فصول وذلك للتقليل من زمن تحميل الأجزاء على الطلاب. كما أن تقسيم الكتاب إلى فصول يمكن أن يساعد الطلاب على إيجاد المعلومات المتعلقة بالمواضيع بسهولة أكثر .

source: What if my book isn't divided into chapters?
ar: ماذا لو لم يقسم الكتاب إلى فصول؟

source: If you haven't broken your text into chapters, you can upload the entire text as a single chapter and enter a name of your choice in the Chapter Name field.
ar: في حال لم تقم بتجزئة نصك إلى فصول، يمكنك تحميل النص بأكمله كفصلٍ واحد وإدخال اسمٍ من اختيارك في حقل اسم الفصل.

source: Individual Unit
ar: وحدة منفردة

source: You are editing a draft.
ar: أنت تقوم حالياً بالتعديل على المسودة.

source: This unit was originally published on {date}.
ar: تم إصدار هذه الوحدة أصلاً بتاريخ {date}.
